[
    {
        "Recommended": 1,
        "Hours_Played": 632.7,
        "Comments": "Posted: December 24, 2018              ***Important Notice***This game does NOT have Steam cloud support (stupid, I know). All of your character data actually saves in a hidden folder under:Windows/User/Username/Appdata(hidden)/Roaming/DarkSoulsIIIBack up the  DarkSoulsIII  file on a usb drive or external.I'm posting this in the review section so more people are aware because my solid state crashed while updating (power went out) so I had to reformat the drive and lost all my DS3 data a long time ago. This was about 130 hours into my first character and boy was I furious, it almost turned me off of the game completely *looks at hours played*...Almost. Please mark this as helpful so more people will see. I do not want to anyone lose their progress because of the lack of cloud support."
    },
    {
        "Recommended": 1,
        "Hours_Played": 110.2,
        "Comments": "Posted: June 12, 2017              Tough but fair. Rewards slow and methodical gameplay. And the boss battles are fantastic."
    },
    {
        "Recommended": 1,
        "Hours_Played": 41.8,
        "Comments": "Posted: June 6, 2018              It finally clicked. Now I get why the Dark Souls series has such an active, enthusiastic, and borderline obsessed community. Although I was hesitant to start Dark Souls 3, I can now say that it is one of the greatest gaming experiences I have had.  Positive:Absolutely gorgeous. It was clear that a lot of thought and effort was put into designing Dark Souls 3. Each area uniquely beautiful and expertly put together; the attention to detail creates a truly immersive experience. I especially enjoyed how spectacular the scenery and menacing the bosses are. The developers did a great job at incorporating shortcuts. Since the areas are quite large, you often get disoriented as you progress (especially during the first playthrough). At a certain point, you come across unlockable door(s) or elevator(s) that connects to a previous area and acts as a shortcut. The sudden realization that you went around in one big circle or that you’re directly above/below a previous area always left me baffled. I really wonder how much time was put into the level design. Amazing combat. Honestly, I’ve barely skimmed the surface when it comes to combat but it is enough for me to recognize how incredible it is. There are so many weapons, movesets, spells, infusions, and more. Plus the combinations you can put together are only limited by your imagination (for the most part). There is a reason why several people spend hours putting together the perfect PVP character(s).Exploration is greatly rewarded. Seriously, there are items, NPCs, and interesting rooms hidden everywhere. It’s gotten so bad that I feel paranoid when I reach a pointless dead end and find nothing - “there HAS to be something here”. Finding a secret felt like finding candy on a scavenger hunt and was thrilling from beginning to end. Keep a look out for fake walls, suspicious ledges, potential jumps, and chests. Beware of mimics though.I really liked the decision to grant the ability to teleport between lit bonfires almost immediately, and to include a safe hub (Firelink Shrine), where most of the important NPCs/vendors can be found. This made Dark Souls 3 more user-friendly (especially for beginners) than Dark Souls 1. Although this made Dark Souls 3 more linnear, I found the clarity of knowing more or less what to do and where to go (also being able to teleport back in case you went the “wrong” way) more enjoyable than the uncertainty I felt when playing the first Dark Souls. For those who don’t know, inter-player interactions play a large role in the Dark Souls series. You can leave notes (to either help or trick others), you can summon other players for a co-op experience, and you can invade other people’s worlds for PVP. I think this is another reason why the Dark Souls community holds strong - despite being portrayed as a single player game, you are rarely alone. I found that the online features (co-op and PVP) worked very well most of the time. Naturally, there are some instances of lag or disconnection, but it is very easy to set up again. Initially I hated being invaded, but I’ve learned to love it for two reasons: The excitement/fear you get from being invaded is intense. It is like a sudden emergence of a mini-boss whose only purpose is to hunt you down. While the defeats are definitely sour, victories are so damn sweet. All the pain you receive from getting invaded can be repaid by invading other people. It’s a sort of S&M relationship, I know, but it adds near-infinite extra hours of excitement and replayability to Dark Souls 3. Neutral:I’m kind of torn about this following point. On one hand, I still find that Dark Souls 3 is not very beginner friendly. More specifically, I had to look up some basic guides before starting the game to understand which stats do what, and what sort of build I should go for. A lot of information, for example stat soft-caps, is not particularly clear to begin with. I find that this steep learning curve, in addition to Dark Souls’ notoriety for being difficult, pushes a lot of beginners away. On the other hand, the Dark Souls series has come a long way, 3 being the most user-friendly and clear game in my experience. After playing it, I realized that I could have easily learned how to build my character through a little trial and error. Granted, my character would not be perfect, but like many veterans say: “no point in Vigor is wasted”. Dark Souls is the kind of game that expects you to pour countless hours in to before you “git gud”, such that a veteran with awful equipment will almost always beat a beginner with God-tier equipment. It should be emphasized that YOU ARE EXPECTED TO MAKE MISTAKES; the complexity of Dark Souls 3 is exactly what makes it so spectacular. I was honestly hesitant to begin playing Dark Souls 3, but it has quickly become one of the greatest gaming experiences I’ve ever had. If you are on the fence, I urge you to give Dark Souls 3 a try. Be patient, learn from your mistakes, and don’t give up - only then will you prosper and praise the sun. NOTE: I’m not complaining about combat/mechanics difficulty - while challenging, I honestly believe that the death/learn-from-your-mistakes system is the number one selling point of the whole series. Conclusion:★★★★✬ ExceptionalWould die again.If you enjoyed this review please follow me on my curator page and group. Your time and support is greatly appreciated!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 16.4,
        "Comments": "Posted: December 23, 2017              It's like all those anime with overpowered protagonists.Except you're not the protagonist."
    },
    {
        "Recommended": 1,
        "Hours_Played": 163.1,
        "Comments": "Posted: September 15, 2017              You'll try. You won't know what's going on. You'll think dying is bad. Your friends will explain things to you, using words like,  Estus shard  and  Praise the sun  and it won't make sense. You'll give up after dying repeatedly on the tutorial boss only to finally kill it and then die to a dog that scares you into falling off of a cliff. Three months later, your friends will convince you to play again. You try it out, only to fail yet again. This time though, you understand that's part of the process, just as your friends had reassured you. You'll roll. You'll roll again, then again. You've done it! The dog that once scared you into jumping off a cliff is dead and you've miraculously taken no damage. Renewed vigor fills you and you continue on. This time you ignore your friends, resorting to the wiki to answer your questions and your own curiosity to guide you to treasure. Suddenly things begin to make sense. You go to bed.You wake up with this incessent urge to play again, oddly intrigued by the story even though you're  not that type of gamer .  Why do I enjoy this?  You'll ask yourself. Soon, you're rolling in real life, to dodge your responsibilities solely to play this game.Didn't think it'd happen to me. It did. Buy it while it's on sale so the first three months of you not really playing it don't feel like,  Such a waste of money.  It's not a waste, even at full price. Amazing game and story. So damned confusing at first but it's worth it. I promise you."
    },
    {
        "Recommended": 1,
        "Hours_Played": 334.5,
        "Comments": "Posted: June 17, 2017              After putting these many hours, I must say that this is one of the best, if not THE best RPG. Period.It's hard, yes. It has a steep learning curve, also yes. But this game is a rare gem among the simplified, straight-forward, linear games that are currently in trend. Rare indeed for a game that actually rewards you for patience and restraint and encourages players to slow down and observe the surroundings and the enemies. Of course, the same can be said about Dark Souls 1 and 2. But Dark Souls 3 is really much more refined than those in a good way. Relatively faster paced combat not only feels more fresh but I think is a necessary step forward in making the gameplay more interesting. Also, the enemies are much more aggressive to compensate for this faster paced combat. Though the lore does not appear to be on par with the one in Dark Souls 1, which I personally believe to be the best in the Souls series. But it is still well above Dark Souls 2, which I personally didn't like all that well.I could go on and on about this game, but for brevity I must say: Everyone must try this at least once."
    },
    {
        "Recommended": 1,
        "Hours_Played": 191.1,
        "Comments": "Posted: April 16, 2016              I summoned a mad phantom with the intention of dueling him, but instead he sat down and offered to toast with me. We continued on throughout Undead Settlement together despite my wariness of him and he helped me take out all the mobs in the surrounding area. After a while, I became accustomed to fighting alongside my newfound friend and started turning my back to him knowing full well that he would protect me to his last, dying breath.We were a team. The best of friends, and nothing could stand in our way. He may not have been a Warrior of Sunlight, but Solaire's legacy thrived on within him. Jolly co-operation resumed until we neared the Curse-Rotted Greatwood...  And it was then that I decided to take yet another chance and summon a second Mound-Maker to see if we could rally him to our side.The plan seemed successful at first. But it wasn't long before I noticed some suspicious patterns in the phantom's movement, and his interest in my backside became a significant concern. My anxiety was proven justified when the phantom took a swing at me with his greatsword and missed.My loyal protector raised both his hand and his middle finger at the attacker, before charging forward with fury the likes of which none in Lothric had seen. He made it his personal duty to end the traitorous life of the one who would dare attempt to strike at me, and before long the violent fool was fleeing from our jolly wrath. He rushed up a ladder and leaped across rooftops before finally dropping a harmful distance to the ground, giving us an opening to attack. My companion launched himself from the rafters and his flowing cape waved majestically in the air as he readied his sword and plunged towards the infidel who would dare spit on the tenets of co-operation and sunlight.The valiant protector lunged his sword deep through the attacker's back before he could escape, the weapon grinding through bone and flesh and rendering him a lifeless husk. I dropped down following this, and we waved and spun our capes at one another in excitement and victorious glee.But this was the end of our time together. We gave each other one final wave before my friend's body started to fade away as he was whisked back to his own dimension. It hit me I'd never see him again."
    },
    {
        "Recommended": 1,
        "Hours_Played": 173.8,
        "Comments": "Posted: March 29, 2017              There isnt any game that will make me feel as connected to my character as much as the Soulsborne Series has. But specifically, Dark souls 1-3.Now dont let my play time decieve you, ive easily played this 3-4x more than the playtime suggests (I also own it on PS4)As such is has a special place in my heart, it might not be the best game the bosses not as hard as some but i made a character and that character i have never had a better representation of my self in any game and ill explain why.In August 2012 i bought a copy of Dark Souls  Prepare to die  Edition. i was going through a hump and honestly retreated further back into video games than i did previously, I remember putting the game on my PC and dealing with the buggy Microsoft Windows Platform but i kept going, I made my character look like me like i always do after the back tingling sensation the opening cut scene gave me. The witches of izalith with thier chaotic flame, Gwyn smiting the dragons, Nito moving with his wrathful stance.And the Pygmy, With his Dark Soul. Sharing it with others. Humanity.From that moment i knew i was in for a hell of a good time. I was wrong obviously dark souls stomped me into the ground but eventually i got the hang of it, Buggy controls or not i had fun, Not just playing the game but reading desciptions of items trying to scrounge up what the lore ment and filling in the gaps that i missed. I wanted more and more, the story was great even if it wasnt offered up straight to you and you had to look for it, and i think thats probably why it was great.Miyazaki once said in an interview that he made dark souls in a similar way to what he experienced as a child, Growing up he had a lot of time alone and he spent it reading, He loved it but his favorite books were those about the knight who goes on daring quests to save a princess or slay a dragon and find treasure, However these books were in english and so he didnt understand them completely, a lot of the information was missing and he filled in the blanks with his day dreams of how HE wanted the story to go. imagining the hardships the knight must have gone through to get to where he was, and he couldnt have done it in a better way than what he did with dark souls, He made a community of people who feverishly try to fill in the blanks of the story even so complex that it makes your head spin.Then there was Dark Souls 2. I continued the fantasy and made my character look like me again, Making it a continuation of my characters story -SPOILERSIn dark souls 1 i chose to not light the flame and walked out to start the age of men, its my favorite ending and if i have the option its the one i always take so to me the story of drangleic was someone else managed to get through and continue the age of fire while i went off and disappeared for an undisclosed amount of time with a dope hat and a ton of soulsTo be fair Dark souls 2's story was lacking more than everyone expected but it was still a great game, the controls were more optimized so the game itself didnt seem as hard and the opening cutscene was great, i got goosebumps when the old firekeeper said  And like a moth to the flame your wings will burn in anguish, Time and Time again  and that was very true to the game we kept going for more even though you would get that angry sensation to just put it down and not pick it up. but you always do.Then theres Dark Souls 3. To me the true Dark Souls 2 is the third, a perfect continuation of the story from the first, probably due to Miyazaki having more influence on this game and not being distracted with a different project (Bloodborne if i recall) and it continued the story for me perfectly, from beginning to end Dark Souls 3 has made me feel like a bad♥♥♥♥♥ I always ALWAYS start Deprived (recommend it to everyone even if you're just starting) because i enjoy the feeling of starting from scratch and tearing my way through challenges to distract me from my challenges in life, i enjoy the struggle and Dark souls 3 Gave me a good fight but like every challenge its there to be completed. and with the release of The Ringed City and Dark Souls 3 : The Fire Fades  Edition the series will sadly be put to rest and to me it will go down in my history as the game that pulled me through depression because even though its hard when i felt like i couldnt accomplish anything in my life the Dark Souls franchise showed me that if i kept trying eventually i could pull through.SPOILERSAs im writing this im sitting in the Ariandel Chapel, I just finished collecting everything from The Ringed City, I killed Dark Eater Midir After a struggle and i gave the Blood of the Dark Soul to the Painting Girl. She is naming the Painted world after me in this burning chapel of forlorn souls. the final road in my journey through Dark souls. I have slain Demons and Dragons and Men. I Conquered Gods and Giants. And ive arisen from the ashes to Usurp the flame a final time. And now it all burns away. The age of Fire might fade. But the age of men begins in a cold dark and gentle place.Thank you Miyazaki And FromSoftware as a whole. For this trilogy, For the DLC. For the adventures and the times i spent jolly co-operating. For helping me pull through. For the Fantasy of Struggle. Thank you.Thank you for the attention this review has gotten, i also editted it a bit so the Spoilers wouldnt be visible unless you hovered over them im sorry to the people who read them before i decided to use my brain and format it properly."
    },
    {
        "Recommended": 1,
        "Hours_Played": 1799.4,
        "Comments": "Posted: November 4, 2017              Dark Souls III, The one game i managed to get over 1500 hours on.Where to start with this...Short VersionThe Pros- Engaging gameplay- Beautiful scenery and soundtrack- Tons of replayability- Varied PVP With both strangers and friends.- Co-op with strangers and friends, to get past those pesky dogs- Memes that may or may not give conniptionsCons- Connectivity may sometimes be an issue when fighting strangers- Requires patience and determination, not for the easily angered.- Difficulty may be a turnoff for people who enjoy more casually toned games- Those people who use a greatshield with great magic weapon in pvp(Skip to bottom for roundup)Long VersionAs someone who has enjoyed the Dark Souls series thoroughly, I feel that Dark Souls 3 has fixed many control issues apparent in previous installments. The combat feels active, rewarding proper timing and enemy management, whilst punishing rushing into battle without a plan and carelessly swinging your blade around. Enemies are placed strategically across the levels, neatly tieing in with their surroundings and backstories. It feels like all of them have a reason to be where they are. Surroundings are interesting, and tell their own little part of the story.The bosses are their own kind of combat. Whilst in the levels themself the challenge is in enemy management, and level exploration. The bosses give you a one on one (usually) death battle, where careful dodging and reading your enemy's movement is key to surviving the encounter. They are larger, stronger and faster then any other enemy in the game, and are not to be taken lightly. Defeating these formidable foes is quite the challenge, and also very satisfying. About the story: you will have to look for it. Although DS3 doesnt hide its story as much as the previous titles, Item descriptions, surroundings and NPC dialogue are essential to finding out what exactly is going on in lothric. Finding all these tidbits of lore makes it exciting to find new weapons and/or items, aside from their obvious use. The singleplayer aspect is fun enough on its own, but the multiplayer aspect makes it whole. being able to summon both strangers and friends to aid you in your journey makes each journey different. Naturally, recieving more aid makes the enemies tougher, along with other risks, like multiple invaders. the arena is always full with people at almost any level, providing unlimited entertainment as players duke it out 1 on 1, or in teams.All in all, its a experience that changes from person to person. with bountiful amounts of weapons to choose from, and more armor than one sane person could collect. theres endless combinations of character builds at your disposal. knights, mages,  pyromancers and clerics, and combinations in all forms. Ive ran through the entire game over 60 times at this point, finding new secrets and tidbits of story still. and with PVP being one of the most entertaining things i have ever come across. The enemies, story, soundtrack and scenery are a joy to return to whenever i launch this game.(continue here for roundup)Basically, if youve played the first two games, youll find a familliar yet refreshing style of gameplay before your eyesIf DS3 is your first dark souls, Youll find a easy to learn, difficult to master game that will keep you busy for quite some time.Overall, I think this is my favorite game in my entire library."
    },
    {
        "Recommended": 1,
        "Hours_Played": 107.0,
        "Comments": "Posted: April 12, 2017              This is my first souls game.I bought this game on a Wednesday night after work when it was one sale. I ran through the cemetery hacking and slashing undead with ease. With the utmost confidence, I took the sword out of the kneeling titan and was promptly returned to reality. Several times. So many times that I returned the game that night saying it  wasn't my cup of tea But a little voice lived in my head. It called me a quitter. Quitters never win.Long story short I bought the game again in the same night and played until I beat him. Feeling victory in this game is exhilarating. The messages on the ground are not the tutorial. Iudex Gundyr is the tutorial and he will teach you patience and persistence. The rest is up to you"
    },
    {
        "Recommended": 1,
        "Hours_Played": 133.6,
        "Comments": "Posted: July 22, 2017              Gorgeous game ahead, therefore try game."
    },
    {
        "Recommended": 1,
        "Hours_Played": 697.3,
        "Comments": "Posted: February 18, 2017              This game (and perhaps DS1) has ruined every other game for me. Since I've started playing the Souls series, I have not been able to fully get into any other game. I'll start playing something else, but am always thinking about yet another way to play this game. Building yet another character (why oh why can I only have 10) using a different weapon and style of play. People ask me whether I get bored playing it again and again. For me it is no longer about level design but rather about discovering new ways to play and challenge myself. For me I feel there will never be another game like this."
    },
    {
        "Recommended": 1,
        "Hours_Played": 100.4,
        "Comments": "Posted: June 7, 2017              I was there to fight Lord Gywn I was there to fight King Vendrick I was there to fight The Soul of Cinder I was there to fight to the end. I was there to fight along side Solaire of Astora I was there to fight along side Lucatiel of Mirrah I was there to fight along side Siegward of Catarina I was there to fight along side them to the end. The Bonfires were there whenever I needed to rest The Emerald Herald was there whenever I needed to rest The Firekeeper was there whenever I needed to rest They were all there for me until the end. Artorias was there when I came to challenge him Sir Alonne was there when I came to challenge him Gael was there when I came to challenge him Honorable knights were there when I came to end it all. I was there to explore Lordran I was there to explore Drangleic I was there to explore Lothric I was there to explore to the ends of the Earth. I was there to Praise the Sun I was there to Git Gud I was there to Finger But Hole I was there to Jolly Cooperate to the end. I Came to the End I Saw to the End I Conquered to the End I Painted to End this world and begin anew. Oh beloved Dark Souls Unyielding sword of the Gaming World Rest if you would For that is your reward.EDIT: This review got seriously popular.Just to be clear. I did not write this myself. I copied it from a Youtube comment because it was just... beatiful and it needed to be here. So credits goes to that guy (He seems to often changes his username, but right know its Ag0rak)This is where the comment came from (Beautiful soundtack too)https://www.youtube.com/watch?v=aJKgS2J9m9I"
    },
    {
        "Recommended": 1,
        "Hours_Played": 558.9,
        "Comments": "Posted: June 27, 2017              Recently I was asked by a friend who is new to the souls series what i thought of this game, so I thought I'd put what i wrote him here.This game is a masterpiece.I'd recommend it, but I will say its hard, like it can be discouraging at times.However, there are few feelings that come close to the sensation of defeating a boss or enemy you've been stuck on for hours.TL:DR= Beautiful game, challenging but rewarding fighting system and a non intrusive but intriguing narrative to boot. 9/10Ill keep the review brief so you can skim through it, because, honestly, you've got to experience the game for yourself to fully comprehend what this game is about.Story= Vague (left to interpretation sorta' thing) but intriguing. You're character seems to be the only one out of the loop and it really helps cement the idea that youre not ready for the grand task you've been given. You'd expect alot of satisfaction from the end of the game, however the real story chunks are tucked away in item descriptions and in the connotations of NPC's.Visuals= F***ing fantastic. Graphics are great even on low settings and this mystical middle age setting looks so ♥♥♥♥ing incredible. The world is detailed and reinforces the main story with hints of the impennding doom that a dark age will induce. Oh, and fashion souls is real, and trust me you're going to spend a lot of time making your character look badass.Gameplay= Toughest part. Easy to learn, hard to master. The levelling system require stat placement which means various builds can be created with various intended functions: from melee builds to caster builds to healing builds. Some styles are more forgiving than others and others require late game items/bonuses/spells to properly flourish. There are, of course, Meta builds that perform pretty well but everyone will also be trying to perfect there own build.Online= Fantastic. Community is still pretty big for PvE and PvP but, the game is getting getting old now. Co-op is great and can be used through most of game (minus something like 3 transitory areas that dont really have anything important in them). Invasions are what made dark souls work: getting invaded and winning a duel makes you feel powerful if its a 1v1. Invading can be unforgiving because of gank squads (2+ players who corner single invaders) but it can be so rewarding when you pull of a whole squad kill and you get to do the infamous 'point down' gesture. PvP has its own arena if invading gets tiresome, so thats a plus. But high wait times if your not around the meta level in arena (Soul level 120 is the recommended meta range). General PvP can be alot more frustrating than other games but alot more rewarding. Mistakes can be unforgiving and there is a big issue with the lag in fights. However, for a guy who I know likes to feel the flurry of a good fight, this s*** delivers. Highly tactical gameplay that rewards smart decisions and good spacing. Dont get me wrong, the arena is useful for easy matchmaking but theres a whole pvp system called fight clubs where players gather in a non dlc area to do 1v1s (fair warning: there are no real rule enforcement in fight clubs so you just gotta' act honorable and hope your fighting compatriots do too and not gank you).Thanks for reading, this has been my first review on steam so I hope its clear and legible :)I look forward to invading you, and may the flames guide thee!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 73.8,
        "Comments": "Posted: November 5, 2017              I had depression.But after playing this game I don't want to die anymore."
    },
    {
        "Recommended": 1,
        "Hours_Played": 61.3,
        "Comments": "Posted: July 31, 2018              3 Stages Of Dark Souls 31. Curiosity Hmmm, since everybody is playing it, maybe I should also give it a try? Okay, not bad, handsome armors, check; majestic catholic church inspired buildings, check; big a$$ bosses, check... Can't help  to see more.2. OutrageGod this game is crap! Game design is cheap as fμck！What? how come he hit me? The hitbox is garbage! I'm done with this game! bang! (The sound of your poor controller slamming to the wall)3. Calm and epiphanyYes, this is a zen game, I should have known earlier. I know your every move, I know every trap and ambushes. Nothing can harm me, I'm shapeless, formless, like water... I feel like a Tai Chi master... Oh, how beautiful this game is."
    },
    {
        "Recommended": 1,
        "Hours_Played": 120.7,
        "Comments": "Posted: May 15, 2018              Did i collect souls or did the game collect my soul?"
    },
    {
        "Recommended": 1,
        "Hours_Played": 549.3,
        "Comments": "Posted: December 15, 2016              Dark Souls is - and always has been - acquired taste. Out of all my friends on Steam, most of whom I know personally and share interests with, I can count those who play Dark Souls 3 on a single hand.When I first heard of Dark Souls, I would have never believed I would spend hundreds of hours on one of the series' games. I was intimidated by the difficulty and attempts to complete the first title resulted in frustration and anger. I felt inadequate, because the setting appealed greatly to me, but I wasn't very proficient at the combat mechanics, which force you to critically analyse your surroundings, memorise attack patterns and generally be cautious. And that's where that ended back then.Then, Bloodborne came out and immediately grabbed my attention and renewed my interest in games of the Soulsborne franchise. It was actually the first of the games I completed.Here's the deal: These games reflect upon your ability to deal with a variety of situations. They reflect whether you are able to handle loss, whether you can keep a cool head in a tight situation. So maybe, you are very impulsive, make decisions on the fly and maybe everything turns out okay every once in a while. But are you able to bear the guilt of your failures, the fact that you have made a mistake? If not, you will rage, you will become frustrated or even doubt yourself. You'll throw controllers and shout at the screen, just as much as you might feel the frustration pulse through you in any situation in life. But can you improve? That is a clear yes. It's definitely possible, but you have to be willing. And overcoming a seemingly unsurmountable obstacle through great effort, training, and self-reflection is a wonderful feeling.Giving you control of a character that seems to be so severely underpowered in a world of giant beasts and magnitudinous god-creatures is intimidating. But along the way you will find that any God may have its weakness and a character that seems weak at first may have unforeseen strengths. The only thing you can rely on is yourself and your willingness to learn and persist, or you may lose your sanity. Everything in this world is supposed to make you feel small, weak and endangered, but you have it in your hand to change the perception you have of yourself.Will you like this game? That depends on you. Are you willing to give yourself a chance?"
    },
    {
        "Recommended": 1,
        "Hours_Played": 92.8,
        "Comments": "Posted: January 20, 2018              ===[ ❤ Audience: ]=== ☐ Kids☐ Everyone☑ Casual players☑ Pro players===[ ☼ Graphics: ]=== ☐ Potato☐ Really bad☐ Bad☐ OK☐ Good ☑ Beautiful ☑ Masterpiece===[ $ Price/quality: ]=== ☑ Full price☑ Wait for sale☐ Average☐ Refund it if you can☐ Don't do it===[ ☣ Requirments: ]=== ☐ 90' PC☐ Minimum☑ Medium ☑ Fast☐ High end ☐ NASA computer===[ ☼ Difficulty: ]=== ☐ You just need 2 arms ☐ Ez☐ Easy to learn / Hard to master ☐ Hard (first few hours)☑ Dark Souls===[ ۞ Game time/length ]=== ☐ Really short ( 0 - 2 hours)☐ Short ( 2 - 8 hours)☐ Few hours ( 8 - 12 hours)☑ Long ( 12+ hours)☐ Endless===[ ♬ Story] === ☐ It doesn't have☐ Still better than Twilight☐ Average☑ Good☐ Fantastic===[ § Bugs ]=== ☐ Game itself is one big BUG☐ Bugs destroying the game☐ Lot of bugs☑ Few Bugs☐ You can use them for speedrun☐ Nothing===[ ✦ Others: ]=== Multiplayer: YesSingleplayer: Yes"
    },
    {
        "Recommended": 1,
        "Hours_Played": 165.1,
        "Comments": "Posted: March 4, 2018              I thought that I would not like Souls games but I am now a fan for life. The difficulty is sometimes unfair but 99% of my deaths are my fault. I got too greedy trying to get another swing in and it cost me. Patience and memorization are important here. It's like a puzzle almost. You learn the level, what enemies are where, enemies attack patterns, find shortcuts. Then it becomes almost trivial the enemies and bosses you had such a hard time with before. One caveat is that I could never get overconfident. Despite knowing what to do I could still screw up so when I die or take a large amount of damage it's my fault.Always respect your opponent, no matter how confident you think you are, enemies can and will punish your mistakes."
    },
    {
        "Recommended": 1,
        "Hours_Played": 106.7,
        "Comments": "Posted: October 16, 2018              The fire keeper is hot"
    },
    {
        "Recommended": 1,
        "Hours_Played": 281.4,
        "Comments": "Posted: April 2, 2018              dark souls actually made me cry"
    },
    {
        "Recommended": 1,
        "Hours_Played": 60.7,
        "Comments": "Posted: November 18, 2018              Acquiring Life lessons from every boss fights.Collecting Sunlight medals from jolly cooperations.Losing sanity from each silly misclicks.This is the only game which can lead you to the best life.Trust me."
    },
    {
        "Recommended": 1,
        "Hours_Played": 171.4,
        "Comments": "Posted: December 18, 2018              After playing  Dark Souls 3, I have learnt a lot of things:1. Being greedy is a mistake.2. Timing is important.3. Always keen for details.4. Dont be cocky.5. Dont Panic.6. Read another player's messages, and dont forget to rate it.7. I should know what weapon I use and my enemies I'm fighting with.8. Firekeeper's kinda hotP.S 9. Zoey is so HOT  that she burnt my  peepee with her Flame fan."
    },
    {
        "Recommended": 1,
        "Hours_Played": 148.5,
        "Comments": "Posted: September 22, 2017              Pros-Fun game-Good story-Combat is fun-Good soundtrack-Turns you into a man-Tough but not impossible-Understand what praise the sun means-Praise the sun-When in doubt roll boutCons-Enemies hit you through walls-Enemys  What is stamina -Experience death like you never feel before-Tears-Pain-Gesture point down-PvP hitboxes-Can't spam-The real final boss is the camera-Lose your virginity11/10 Reason to get this gameGit gudPraise the sun"
    },
    {
        "Recommended": 1,
        "Hours_Played": 487.3,
        "Comments": "Posted: March 30, 2017              I just beat the first boss"
    },
    {
        "Recommended": 1,
        "Hours_Played": 92.1,
        "Comments": "Posted: February 4, 2018              Let me note a couple things, first off this is my first ever actual review so please don't chew me up.Second, an absurd amount of people are getting this from Humble Bumble this month, which is good dont get me wrong but you should probably know what you're getting yourself into.I also dont have much experience with the other souls game but thats subject to change, in other words this is coming from a strictly Dark Souls 3 player, no bias from the other games or any of that.As for gameplay I believe this game excels once you get ahold of it, I caught on pretty late, didnt know what fat rolling was or why I was so slow up to Yhorm before a friend explained it to me, so yeah, darn. Speakings of Yhorm I didn't like the  Storm Ruler   gimmick at all, same goes with Wolnir's  Braclets  I mean you dont technically have to do the Yhorm thing, but its your best bet, I digress. Other then the little things that made the game that much easier, the gameplay kept me on my toes, and my controller(s) accross my roomSoundtrack wise it really stuck with me as well, especially the Main Menu theme, cause who can forget it?Lets talk about the Story, this is pretty difficult to pick up on for the most part, you have to read vague item descriptions and do the little side quests to really get into it, I'm gonna summarize it for you guys though.You are the Ashen One given the task to hunt down and return the five Lords of Cinder to their thrones in the Firelink Shrine to Link the flame once more in order to prevent the age of dark.I think I'm gonna bring up replayability lastly, because thats usually pretty important, which its there.Between NG+ and the achievements I've sank a good 40 hours of my time into this game in 2 weeks, according to steam, which may not be super impressive but its been an everyday routine to hop on and progress on my favorite RPG to date.My final verdict? Buy it and dont give up, this game is HARD to put it lightlyGameplay = 9/10OST = 8.5/10Story = 8/10Replay Value = 8.5/10Total Score = 9/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 439.3,
        "Comments": "Posted: June 29, 2018           Product received for free              Seriously, one of the best games i've ever played in my life.I've never been a fan of RPGs myself, always went for FPS games. But i got an interest for this game, for it was known for it's  diffculty  (more onto that later), the bosses, the sceneries, etc.I was gifted this game, and i have to say, it was one of the best gifts i've ever received.About the game itself, if you are scared to pick it up, don't. The game is not as hard as people make it out to be, it just leaves you to discover stuff for yourself, to learn the mechanics, playstyles, etc.This game is by far the best for beginners to the DARK SOULS franchise, for it has the most polished gameplay out of the three, with some more simpler mechanics...kinda of. Parries are definetely something that actually requires a bit of skill, and the same goes for backstabs, to a certain extent. You have to be more precise with stab than in previous games, but we're getting offtrack. The story is good, nothing really amazing, but the main focus of the story is good. The lore of the rest of the kingdom of Lothric (and the DLC worlds too) are what's interesting about DARK SOULS games. The lore of every boss, every area, every enemy, it's all really fascinating and well crafted, just like in other games, so it doesn't disappoint in that regard.Gameplay in itself i found pretty satisfying, but i do think the PVP part of the game could have some problems fixed (Hackers, Griefers, etc)Soundtrack in the game is also pretty awesome. There is something in particular about the Final Boss' theme that has made a lot of people really emotional (myself included). It's a really cool easter egg, but i won't spoil anything. This game's music is something you have to experience yourself to understand how awesome and well produced it is.The game in itself is beautiful. It has stunning graphics and is extremely well optimized (except for the beggining of the Ringed City DLC, all the ash may eat up your frames). All the effects, boss fights, sceneries and enemies have an immense amount of care put into them, to make them feel like they belong in this fantasy world, and to look the best they possibly can. In short, DARK SOULS 3 is an amazing game, not too far from a masterpiece in my opinion. Shame that it still has some things that should've been improved by this time, but whatever, the game is still playable. I highly recommend giving this game a try. Seriously, it's amazing."
    },
    {
        "Recommended": 1,
        "Hours_Played": 1155.4,
        "Comments": "Posted: March 13, 2018              Ok I think I have played this game enough to give it a proper review. ====TL:DR====Great game single player wise. Excellent boss fights and music. Fairly high replayability value. Tons of weapons, armor and spells for you to try out. A few glitches in PvE but nothing serious. Feels closer to Dark Souls 1 than 2.Co-op is fun as always. PvP has some issues so it's a hit or miss. There are some bugs in multiplayer caused by lag.As for DLCs, 1st DLC felt short. But it has a great boss fight. 2nd DLC is simply amazing. Well worth the money.I highly recommend this game. This has become one of my all-time favorite games.Lengthy but detailed review ahead.======The bad======Game has slight occasional glitches such as enemies glitching through terrain, enemy projectiles going through solid objects such as walls or even the floor. Keep in mind these are not frequent. Some people may experience micro stuttering issues even on capable hardware.Spell casting is more difficult in this game due to two reasons. You can't reliably cancel casting animations (except healing miracles). This makes using magic against fast bosses/enemies a nightmare. You don't have a fixed amount of spell uses like in previous games. You have a mana bar. (called FP in this game, I just call it mana) and you have to use Ashen Estus flasks to refill your mana bar. This is not a bad thing. The bad thing is you have to allocate some of your healing Estus flasks as Ashen Estus flasks (you can change the amount). A mage already invests a lot into stats and equipment (just like previous Souls games) but now mages must sacrifice some of their healing Estus flasks as well. I call bull on this one.Ability to dual wield pretty much any weapon combination and powerstancing is GONE. One of the best things Dark Souls 2 brought to the table, is just gone. There are some paired weapons in the game but they are few. You can still equip weapons in both hands but the ones in left hand cannot use their full moveset.New Game+ is not nearly as creative as in Dark Souls 2. There are more powerful versions of rings in NG+ and NG++ but that's it.The biggest issue in multiplayer IMO is the bugs that are mainly caused by latency issues. For co-op, it's possible for friendly phantoms to get stuck outside the boss fog gate (can't go in). This is because friendly phantoms are not yet properly synced with host's world. This will be obvious to you as the phantom since host player's animations will be static until you're properly synced. If it's a friend you can ask him to wait. But can't do that with random strangers. I never summon people because of this. However I place my summon sign all the time and it goes without issues most of the time. For PvP, it's possible that you can never hit the invader because he has no hitbox (invader is not really cheating here). Just like friendly phantoms have no hitbox when you try to attack them. But the invader can hit you just fine. This issue only seem to happen when you have friendly phantoms in your world, regardless whether they're NPC or actual people. It's as if the game mistakenly treat the invader as a friendly phantom on your end but on their end, it's normal.PvP was not enjoyable for me. Invasions prioritize hosts with friendly phantoms so if you invade, you'll be fighting multiple people at the same time. The game has much faster combat in PvE than previous Souls games so rolling cost very little stamina and healing with Estus is almost instant. These things make PvP a headache. In invasions everyone can heal, even friendly phantoms and invaders. This is very annoying when you're a lone host (like me) and invader runs behind enemies and use Estus.========The neutral========This game has no standard poise. Some weapon skills and spells grant you poise for a brief moment. You still have hyper-armor. This can be good as you won't run into havel monsters with straight swords. This is not good when a puny hollow with a tiny broken sword can stagger you when you're in full havel armor which literally made of heavy stones.Game is very linear compared to previous Souls games. Personally I don't mind this. But it can get repetitive when you're doing another playthrough.A lot of fan service of Dark Souls 1. I don't usually mind this but sometimes it felt a bit too much.=======The good=======Ok finally we get to the good stuff.Despite all the issues I mentioned, PvE gameplay is still really fun. Weapons have smooth transitions from one attack to the next. You can play smart using both melee and ranged weapons to make things easier. Combat is a lot faster and way more fluid than previous games. This makes some fights really intense. And as usual, the game is quite challenging (except in the beginning)Weapons have weapon skills that use your mana bar. These are special moves or sometimes buffs. Some of those moves are downright crazy, in a good way.Most boss fights are simply AMAZING. Has some of the best boss fights in the series and some of the most difficult. Bosses have good AI and most have a good amount of different attack patterns. And some bosses are quite fast. They'll definitely keep you on your toes. Boss fights also change usually midway into the fight.Most boss soundtracks are incredible. This one has the best music in all the Souls games IMO.Fairly high replayability value. (not as high as Dark Souls 2 though) I had a blast playing the game with different characters (some melee, some magic). Also did SL1 challenge run and a bow only challenge run. They were more fun than I'd anticipated.Co-op is still awesome. No more Soul Memory. You can set a password so only those with same password can connect to each other. This method override usual things that restrict connecting with people, things like being in same Soul Level range. This makes playing with friends easier than ever. Even a very high level character can join a low level character, but high level characters will be nerfed to match the host's level.Overall I highly recommend this game based on how awesome single player content is. Praise the Sun "
    },
    {
        "Recommended": 1,
        "Hours_Played": 85.0,
        "Comments": "Posted: June 23, 2018              First DS game and ♥♥♥♥ me, sleepless night already and I bought it yesterday/today...I'm hooked so hard, I never really played ''difficult'' games but if its like this masterpiece ♥♥♥♥ing take my money.P.S it's not hard as you think, but its so ♥♥♥♥ing fun even for noobs like me."
    },
    {
        "Recommended": 1,
        "Hours_Played": 208.7,
        "Comments": "Posted: August 11, 2017              DARK SOULS™ IIIImportant premise: the following review is based on my personal experience.            Pros        Cons                    Soundtracks    Care for the details    Dubbing    Sceneries    Realism    Originality            Online functionalities    Gameplay faults    MatchmakingExplanation Pros:                The soundtracks have been realized with an incommensurable mastery, passion and love. Each one of them is perfectly coherent with the experiences the player is living, and perfectly represents the story and the essence of every boss that is encoutered.    The care for the details is undoubtely impressive. The ashes flying away from the torch with a direction based on the wind, the areas and structures design, the camera view getting blury while passing through a spiderweb, the shadow of the main character getting bigger or smaller based on his distance from the fire, and much more.     The dubbing is, in my honest opinion, spectacular. I believe I have almost never heard in a videogame such realistic, convincing  voices, other than perfectly coherent with every meetable character.    The sceneries are incredibly realistic, full of atmosphere, and some of them even majestic, thanks to the praiseworthy care for details and the excellent sound effects.    Realism is another strenght point this game has. Naturalness of the character's movements, alongside with npcs, common enemies and bosses; in a specifical boss fight, the huge wings flapping of the enemy makes the character tossing back due to the huge air blow; during another boss fight, the enemy roared as sign of victory after defeating me.  What I want to say with these examples is that it looks like reading a fantasy book and living it firsthand.    There is also a lot of originality: you never know what's coming, every boss fight is different from the others, there are some environmental interactions that have to be done in order to proceed, and much more. I can't continue with the examples because they would be dangerous spoilers, but I can surely say that, after sometime, I just kept being surprised over and over again and left for a long time speechless.Cons:               The online functionalities still have evident problems, especially about PvP (Player versus Player). From my personal experience, 70% of the times there was a huge lag that made the game session basically unplayable, despite my internet connection is more than suitable for it. The introduction of limited area matchmaking function helped just very marginally, having almost an unnoticed impact. Luckily, the PvP arena seems to be immune from this problem. Also, the online is not free from hackers (altough it's very rare: I just met one in 127 hours of gameplay. He didn't take any damage despite the constant blows that hit him).    There are some gameplay faults. For example, some enemies can still hit you through a wall, there are very rare problems with environment interactions (sometimes when I walk up and there are stairs, my character got blocked and I had to change direction to  unlock  him); artificial intelligence very rarely not working properly (attacking randomly if provoked from distance; attacking the character and then randomly returning to its position). I have also experienced some rare, random and huge FPS drops, despite my machine can easily run this game with every setting on maximum without any problem. I solved it by  reloading the area . Very rarely, some enemies got stuck inside the surfaces. Finally, when I tried to deposit some items in the storage, they returned back to my inventory.     The matchmaking is indeed criticizable, because it completely ignores the skill difference of the players. This usually causes an almost immediate victory / loss without the  loser  even having the chance to react. For example, out of the 70+ PvP matches I did, I won only one. Final considerations: I personally do not recommend playing this game with a guide, because it might ruin the surprise element, one of the most important features this product has. Even if you are in great difficulty, you can always ask for help to the community. There are a lot of good players who will be glad and willing to help, assisting you through jolly cooperations. If you  feel like you need a pause, or simply do not want to go foward, you can always help the others by being summoned as a ghost in any area you have already visited: in this way you will be able to explore better the places you have already been at, and where you will have to go, while helping another player. The main plot, linked to the two previous games, concludes here, giving generally any explanation to the unanswered questions, through dialogues, descriptions and surroundings. It's a game rich of contents, probably the richest (it took me more than 120 hours to complete it, while the previous ones required me 82 and 90 hours each). The dlcs are definitely at the same level of the main content, quality speaking. This game is good both for people who don't care about the plot and want to just smash everything and for the ones who instead are interested to it. Howewer, for the second ones, I strongly recommend to firstly play  Dark Souls: Prepare To Die Edition  and  Dark Souls II: Scholar of The First Sin , in order to understand what's going on (or just watching a Youtube video that explains it, if you don't wanna).I definitely suggest this game to anyone who likes the genre.  Personal scores             Graphics        Amazing                 Plot        Great                Gameplay        Good                Sound        Excellent                 Music        Amazing    If you have any questions for further information, feel free to ask. May the Flames guide thee ."
    },
    {
        "Recommended": 1,
        "Hours_Played": 197.8,
        "Comments": "Posted: December 9, 2016              'I am a Fire Keeper. I tend to the flame, and tend to thee. The Lords have left their thrones, and must be deliver'd to them. To this end, I am at thy side.‘The Fire Keeper__________________________________________IntroductionTo cut a long story short:  Dark Souls III“ is a great game and also a perfect start for anyone that has not played a 'Souls' game to date. From Software came up with interesting ideas to make weapons more diversified, the world and most of the levels are interesting and full of secrets and as usual there’s a lot of hidden lore for people that are interested in story and motives. However from my point of view the game has also lost a bit of the atmosphere and 'essence‘ of the early 'Souls' games. Especially the feeling of hopelessness and solitude is even rarer than in 'Dark Souls II' and the difficulty of the journey changes a lot between challenging and cakewalk.According to director Miyazaki From Software will now focus on new projects and  Dark Souls III  will be the last 'Souls' game for the next years. On the one hand this is a sad message but on the other hand I’m glad that the quality does not decrease with yearly new instances without many changes. __________________________________________The kingdom of Lothric and its tragic storyThe overall story is - as usual in a 'Souls' game - based around the cycle of Fire and Dark:Fire is fading and you have to return the five Lords of Cinder to their rightful thrones in order to link the fire once more.This time you are neither an Undead nor a Bearer of the Curse but an 'Unkindled One‘, born from the ashes of an Undead Warrior that failed on his mission. Everything is as ominous as ever and leads the protagonist into a long and dangerous journey through the kingdom of Lothric. There are lots of areas, items and names that link back to the precursors and there are some really atmospheric levels with great design and architecture and lots of hidden secrets and loot (I’d like to mention 'Archdragon Peak‘, 'Lothric Castle‘ and the 'Grand Archives‘ here). By the way: the game looks gorgeous. From Software was finally able to spice the game up with some beautiful graphics in addition to the fantastic style.Here are two screenshots to give you a better impression:http://steamcommunity.com/sharedfiles/filedetails/?id=744858087http://steamcommunity.com/sharedfiles/filedetails/?id=741326897Sure, all 'Souls‘ games looked good due to their unique style but the amount of muddy textures was simply too damn high in the earlier titles.__________________________________________GameplayAside from the fact that the whole game feels a lot faster and agressive than the precursors there are some changes to spells and dual wielding in general and the new 'Weapon Arts‘.'From Software' brought the MP system from 'Demon’s Souls' back and went away from the fixed amount of casts. 'Ashen Estus Flasks' are used to recover the so called FP (Focus Points) and the 'Attunement‘ stat now gives more FP in addition to attunement slots.  Moreover they changed the dual wielding system: Not every weapon can be used for dual wielding styles anymore, instead there are some specific 'Dual Wield Weapons‘ like e.g. the 'Brigand Twindaggers‘. Every Weapon has also a 'Weapon Art‘, a powerful special attack like a mighty blow or a useuful skill like e.g. a quickstep. Some of them are defined by the Weapon Class (e.g. the Weapon Art of most Straight Swords or Shields is the same) but some are truly unique. This gives some extra spice to several weapons and finally makes many of them feel more diversified aside from raw stats. __________________________________________Multiplayer and PVPFrom Software has finally included a password function for easier access to e.g. co-op games or fight clubs. Aside there’s the usual stuff: several convenants with different goals, the summoning for bosses and areas and interesting/frustrating PVP that is always a difficult topic in the 'Souls‘ games. You can definitely rant hours and hours about it, especially about balancing and viable options. However I have to admit: When you get a 'good‘ opponent that plays a fair duel things can be a lot of fun despite the typical 'Git Gud‘-massacre. Unfortunately From Software dropped interesting convenant ideas like e.g. the Rat Convenant (you made others invade your world to lure them into a madhouse full of traps and enemies).__________________________________________ContraOne thing that bothers me a lot in this game is how it handles NG+. It's a massive step backwards compared to 'Dark Souls II' which did something amazing here: it changed stuff. In NG+ there were not only new drops to many bosses but also you were able to encounter a lot of new Phantoms in the areas, there were changes in some boss fights (e.g. the two Pyromancers during the Lost Sinner fight) and even stuff that surprised you completely like e.g. the two Pursuers in the Throne Room or the 'surprise attack‘ of 'Duke’s Dear Freja' on your way to Brightstone Cave Tseldora. This brought some variaton to the game, which was really needed in NG+ from my point of view. Unfortunately they left this out of 'Dark Souls III': Aside from upgraded rings that you can only find in NG+ and NG++, NG+ is exactly the same.It’s a pity, those were fantastic ideas and a great start to a more 'diversified/changed‘ NG+.Moreover I have to say: The game feels pretty easy from time to time. Sure some bosses give you a nice challenge when you fight them for the first time but afterwards I rarely had a problem. The feeling of winning after trying over and over was so rewarding and I kind of miss this for most parts of the game. Maybe that’s the point - I already spent a lot of time in the 'Souls' games and earned a lot of experience. I guess for everyone that plays the series for the first time it’s still pure madness. A shame that there’s no 'Champion Convenant' this time though.__________________________________________Conclusion'Dark Souls III' shows me once more why I love the series. Design, architecture and style of the world are fantastic, the gameplay is fluid and responsive and exploring the areas feels worthwhile. Moreover the lore is amazing and I love reading all the little hints and listen to the mysterious dialogues. There are some challenging areas and you are always happy when you find an interesting weapon or level up your character. Sure, aside from all the good facts I also mentioned many points that are - from my point of view - 'weaker‘ than in the earlier titles. Not all changes are great, but that does neither mean that 'Dark Souls III‘ is a bad game on its own nor that it is a bad 'Souls' games. Those are simply aspects where I think that they are weaker than before, but maybe I am a bit nostalgic here – as we all know there were always flaws in the 'Souls' series and stuff like balancing was always a difficult topic (e.g. the 'Scrapping Spear‘ from Demon’s Souls). However 'Dark Souls III‘ has its own style and atmosphere and that makes up for a lot. And moreover it’s way more accessible for new players and a great start for anyone to the whole 'Souls' series – you can respec your character, many of the bosses and enemies are more forgiving for mistakes and in PVE there's less ganking and less ambushes that simply frustrate you.I’d rate it 9 out of 10 points on its own and maybe 8 out of 10 points as a 'Souls' game. Damn, maybe I have finally turned into one of those infamous Undeads that praises the first game(s) and hates on the successors.May the sun have mercy upon me.Praise the sun! This endorsement approved by The Reviewers' Union,providing better standards for reviews and reviewers."
    },
    {
        "Recommended": 1,
        "Hours_Played": 125.7,
        "Comments": "Posted: November 20, 2017              Dark Souls III was my introduction into the souls universe and it was truly an amazing experience. I was always put off from dark souls just thinking that it was a little to weird and out there for me to ever really give it a try. However giving Dark Sourls III a try was one of the best gaming decisions I've ever made. This game has some of the best combat I've ever experienced in any game and and the sense of adventure is amazing to experience. I have had more fun in this game than I have had in any other game in quite some time. I would highly recommend to anyone on the fense about playing this game to do it now. I truly do not think you will regret it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 137.5,
        "Comments": "Posted: June 13, 2018              TL;DR - YES, it's good. NO, it's not nearly half as scary as you've been told. Don't be a chicken and give it a try. Probably wait until it's on sale though, the game certainly isn't new anymore.-Technical Stuffs-I'm running a pretty mediocre i5 processor, a mediocre 8GB of RAM, and an equally mediocre 2GB Radeon RX 460 GPU. I've set my graphics quality to 'high', which gets me a clean, steady 40 fps. I don't terribly mind, I can't really see the difference between 40 and 60 fps anyway. Dialing the settings back to 'medium' boosted my frames by an entire 5 fps on average, so that wasn't worth it.I haven't had any crashes yet and haven't encountered any bugs - the game runs perfectly fine for me. -Difficulty-Okay, let's get it out of the way. Is Dark Souls 3 difficult? I mean... kinda, and you'll almost certainly die a *lot*, but it's also very kind to its players.The thing is, DS3 very much expects you to royally mess up pretty much constantly, and it's balanced around that. You can suck as much as you want to, and you'll still be fine afterward; dying doesn't make you lose anything you can't regain fairly quickly.Just take every enemy seriously, even the most common of mooks and the freaking *tutorial enemies*, and don't bother being mad about dying, and you'll be fine.Winning is also never a mathematical impossibility - no matter how crappily you've leveled your character, you can still beat the game with it. Heck, some people take on the game at LV1 (and some even without equipment) *for fun*. I'm not saying it would be easy (because it REALLY would not be), but it's possible. So, seriously, don't be intimidated by the Souls-series' scary reputation; it's not fully warranted, and you're missing out on one hell of an experience. -Gameplay-First off: Yes, you can play DS3 with keyboard and mouse if you're used to that. You might want to put up a sticky note translating the shown (controller) keybinds if you have difficulty navigating the menus, but apart from that, KB/M is perfectly fine and occasionally very useful because it helps with camera management. Oof. What else to say? Melee combat, especially with a controller, is smooth as all hell. Magic is *fine*, but something Skyrim honestly does better. I'm happy with the gameplay, basically, but gameplay is generally not my main focus.-Visuals-OH MAN DS3 is a pretty game. Hardly anybody ever mentions that about Dark Souls, but the design of both characters (human-ish and monstrous alike) and environments is really, really good. The environments are dense, and the render distance and texture quality of far-away backdrops is positively ridiculous. I adore the cloth pysics in this game, too. On sale, you could easily buy the game for the visuals alone.(Only (three-second long) exception: Lothric's face when he resurrects his brother. DUDE, what happened to your high-definition facial textures? You look like you fell out of a very shoddily upscaled PS2 game!)-Audio-Yup. So much yup. Much of the game is surprisingly silent, but when there's music (mostly for the boss fights), it's *incredible*. Very epic, but also very fitting, and finely tailored to the circumstances in which the music plays. I'd listen to it all the time, but it gives me sudden feelings of dread.-Story and writing-Very sparse, but the things you can piece together from dialogue and item descriptions sound intriguing. NPCs tend to stay pretty flat and personality-less, with a few exceptions. Funnily enough, few people will agree on those exceptions. Few people will agree on *anything* in this series, but that's neither here nor there.The weirdest thing about Dark Souls in general is how everyone chuckles creepily every few lines. It's very strange, really.(also, the unironic use of 'thee' combined with the over-the-eyes headpiece of the Firekeeper reminds me of the Mouth of Sauron, and that's a mental image I *really* did not need)-Additional Comments: Visual Design, Worldbuilding-Yes, I'll ramble on about that some more.Everybody keeps raving about how  amazingly difficult  those games are, which never interested me much. You know what would've made me play those games *years* ago, though? Somebody mentioning that DS3 in particular is a highly unconventional look at what's essentially a post-apocalyptic world, or that you play various flavors of undead characters in all three games. That is SO AWESOME.DS3 also loves to contrast and combine purity and corruption, light and dark, holy and demonic in something that's pretty much my entire aesthetic in video game form. So many creepy, corrupted cathedrals! Evil angel knights! Morally dubious gods and equally morally dubious people worshipping a great many things! ALL the lovingly modeled Gothic architecture!Have I mentioned the amazing architecture yet? Sure, I'm a bit of an art and history nerd, but I've spent hours staring at pillars because they're so pretty. In DS3, reality and the space-time-continuum is completely falling apart, the world is stagnant and full of unchanging undead, aesthetically rotting, full of half-decayed wall hangings and carpets in gorgeous buildings, brittle gothic-inspired furniture everywhere... I love that so, so much. -Additional Comments: Community, Multiplayer-Multiplayer is divisive and the community tends to feel very strongly about pretty much everything; the tone is much rougher than in most other games I've played. It's stilly pretty fun, though, you just need a healthy sense of humor and the ability to keep your competitive nature in check. (Seriously, don't be That Guy, DS3 has way too many That Guys already)PvP matching is level-bound, so be sure to give it a try from the start; the higher your level, the more difficult starting out would be. You also get rather important items from PvP - you can farm them offline, there's nothing in the game that *requires* PvP... but having to farm those items is generally not a very fun time.-Additional Comments: Business Practices-You can get softbanned from online play for a large array of mostly harmless things (such as using camera mods in offline mode for screenshotting purposes), mostly without an option to rectify that. Some players have reported getting banned without being aware of doing anything wrong at all. FromSoft's solution to cheaters deliberately getting people softbanned amounts to  keep backups (which a handful of people have reported being banned for, of course) and don't get screwed over by cheaters . Real smooth, that. It's honestly the only real gripe I have with that game."
    },
    {
        "Recommended": 1,
        "Hours_Played": 87.1,
        "Comments": "Posted: September 14, 2018              Gives you depression and deep thoughts about humanity, but yet, one of best soundtracks you will ever hear, in games or movies, and great story.. Sad there won't be more of Dark Souls.. 10/10 game <3"
    },
    {
        "Recommended": 1,
        "Hours_Played": 484.8,
        "Comments": "Posted: December 14, 2017              So, I bought Dark Souls about 6 months after it came out on pc and well, I was not impressed. I initially didn’t have a controller, even after I picked one up I just wasn't into the movement of Dark Souls. It felt so clunky. . It just seemed like lame, slow combat with no sick moves haha.  At the time I was playing Kingdoms of Amalur or another action/rpg like that. With my issues with the gameplay aside, I would have been down to stick it out and see what the game was about. However I quickly got frustrated with the so called difficulty of Dark Souls. The limiting bonfire system, no quest helper/tracker and the minimalist dialogue from the one npc at firelink made me just give up. I didn't see much of a story and what I did see was about as convoluted a story as I had seen.With all of the frustration I had with Dark Souls I admit I still found it intriguing. I said to myself if they “fix” the movement and gameplay then I’ll give the series another shot. And so I waited, wanting to explore this acclaimed series but trying to find a more accessible entry point. Dark Souls 2 came out and I was tempted but still apprehensive.I bought Bloodborn on PS4 played it for 10 minutes and never played it again. My fault. And then Dark Souls 3 came out, finally, the “modern” souls game I was looking for.*********Spoilers**********************Obviously, I waited for a Steam sale. I finally purchased Dark Souls 3. I was hoping that this would be a way for me to get into the Souls universe. I remembered the vague and cryptic story I had experienced and I was stoked to get into this. So I started up Dark Souls 3 (again without a controller) and after 3 hours I got past Iudex, the first boss. I was excited by the movement being much smoother and also frustrated by the keyboard.  So I proceeded on with the game, moving onto Lothric Castle. I quickly became frustrated with the controls and I just could not progress, knight’s op versus keyboard. So I went out and bought an Xbone controller. I also started watching a let’s play on YouTube. I was determined to give this game all I had this time. I slowly proceeded to get better and more comfortable with the game and the combat. I died to probably every single enemy in that castle.   My deaths, at that time, were far more stupendous than my kills. Die to the Dragon. Die to the skeletons next to the dragon. Die to the Knight after the skeletons. Die to the terrifying-possessed-zombie-thing next to the knight. I learned a valuable lesson with all that dying. Never underestimate an enemy.     A combination of fear and excitement made me slowly progress to the first REAL boss. As I finally encountered this beast I have to admit, I was awestruck. That thing is badass! And he proceeded to ground me into dust. He’s huge he’s strong and he’s fast? How do I kill this thing? I went in knowing this was gonna take a few tries.  Haha, after the tenth time I was ready. I knew this ♥♥♥♥♥♥♥s moves and he was going down! Popped an ember and… You Died.  Four more times and I finally owned that beast, the satisfaction was great, and, the relief of the bonfire was greater. Whew!“So this is Dark Souls?” I thought.“This is hard. But doable.” I ventured forth looking to own some more heirs of fire. I rambled through the next areas trying to figure everything out as I went, but I would also be watching my trusty let’s play youtuber to share in my pain and triumphs. That really helped me as the Dark Souls mood can really creep you out! As I slowly grew more powerful, I dabbled in pyromancy. I found my first Ultra Greatsword. I found side bosses and explored and learned about this tragic world. Making my way through the middle of the game, I began to see some of the beauty of the world. There are some truly amazing sites in this game. Irithyll Valley. Anor Londo. So cool.The bosses! Abyss Watchers. Pontiff Sulyvhan. The Dancer. Demons. DraGONS. GiANTS!!! WowSo here I am now, just sitting in Archdragon Peak waiting to find the courage to beat the Nameless King. And so now, coming full circle, Dark Souls 3 has made me decide to play Dark Souls again. Just to give it another shot. Now, I‘m a level 38 Pyromancer heading down to the catacombs. Been enjoying the hell out of it. Not as smooth as Dark Souls 3 but definitely great. This game is one of the best gaming experiences I’ve ever had. I really can’t say enough about this game.Thank you From Software!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 242.8,
        "Comments": "Posted: March 5, 2017              Tip from someone who recently beat the game.You can use the cord for your controller to hang yourself.Due to many responses as to having wireless controllers bash your head with it until you forget about the game or you die doing it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 73.8,
        "Comments": "Posted: December 5, 2017              Dark Souls 1 - After a journey of misteries and many lifes wasted in failure, like Artorias, the knights of the White Path, Knights of Catarina, and many than others, all the knights that followed the Great Lord of Sun, Gwyn, into the kiln of the first flame fighting the curse and the end of the Age of Fire. We kinda felt the duty to accomplish our mission and sacrifice ourself in order to not make their past vain, becoming nothing but a puppet in the hands of gods.Later, we discover that everything was useless.Dark Souls 2 - Nobody remember anymore of the Four Lords, just their souls remained in this corrupted world, Drangleic, four powerfull souls from the Lands of Lordran.King Vendrick is looking for a way in order to win the curse, and it seems he managed a way to stop it, but not to heal it. In the meanwhile his brother Aldia, scholar of the First Sin, discover the real cause of the curse: a seal created from Gwyn in order to keep the first flame alive. This is the First Sin of the Gods, their want not to die.After we  kill  Aldia, he tells us the most important thing of the series: But the question remains.. What do you want, truly? Light, Dark, or something else entirely? Dark Souls 3 - The flame is now fading in a way that never been before. Lothric refused to link the Fire, that's why bells called for us, champion of Ashes, the resemblance of all the failures of the past. We must find the Lords of Cinder and make them linking the fire, no cares how we manage to do it. During our journey, someone is looking after us: the black church of Londor, descendant of Kaathe's will. We discover that we can usurp the First Fire and give it to the Real Darkness, becoming the Lord of the new age of Humanity.The path of the big betraial, where we cover all the past with ashes in order to break the cycle of the Fire and creating something completely new, an age without Gods, only humans, and gentil darkness..So here we are, at the real Kiln of the First Flame once again, fighting the manifestation of all the cursed ones who decided to sacrifice for the Age of Fire, for their Gods.A fight beetwen the traitors and the serves of Gods, the last fight.Once we manage to win the Soul of Cinder, here something happens.He revives.Nor his body, just His will to not be forgotten.Lord Gwyn, the first lord of Cinder. His soul is still here, fighting for the last time trying to keep the Fire alive.But everything is useless, 'cause every fire will turn to Ashes.And so the flame will fade, and so the world will be merged from grey, silent ashes.Meanwhile, a strange painter is making his last paint, imaging a new cold, dark and gentle world. A world painted with the blood of the Dark Soul, the same souls that tried to emerge all this time, the same caotic soul that wanted freedom from the seal of Light, the seal of Fire.A new, dark world, where Dark Souls could be free.That's the story of many of us, the story of choices, different paths who converged into the same, peacefull end, 'cause everything will vanish, every flame will fade.Thanks Miyazaki, and all the working team.Thanks From Software, and absolutely thanks to all the players who lived in this trilogy."
    },
    {
        "Recommended": 1,
        "Hours_Played": 150.0,
        "Comments": "Posted: November 18, 2017              Give this game to a stubborn person and watch them go on the brink of insanity. Would Recommend."
    },
    {
        "Recommended": 1,
        "Hours_Played": 1973.1,
        "Comments": "Posted: June 22, 2017              It took me more than 1,000 hours, but I finally got gud."
    },
    {
        "Recommended": 1,
        "Hours_Played": 502.4,
        "Comments": "Posted: November 21, 2018              Don't give up, skeleton!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 4.4,
        "Comments": "Posted: October 20, 2017              This game is just like dark souls"
    },
    {
        "Recommended": 1,
        "Hours_Played": 58.7,
        "Comments": "Posted: October 11, 2016              Into the Deep EndAs a Dark Souls newbie, this game was extremely punishing at first and tested my patience to the next level. Never have I been forced to realize how bad I am at combat. True, unadulterated, combat. The kind where it is your fault for going in too deep when the enemy was preparing an attack. Where slowing down and observing is just important as attacking. Death after death, and then some more for good measure, I finally managed to take down Iudex (the starting boss)…down to his second phase. Of course he had to have a second phase, I mean, it’s only been 5 minutes since I created my character and this guy is more difficult than most games’ final bosses. Alright fine, let’s try it again….and naturally, the stupid skeleton guarding the boss entrance chunked me for half of my health. This obnoxious heathen never managed to hit me in my previous 16 runs, but now its eyes gained some sort of holy enchantment to make every arrow land on my back. This is the type of game DARK SOULS III is. One without mercy, care, or pity. It took me approximately 2 hours to beat Iudex as a starting Mercenary, but the thrill and adrenaline post-battle was truly something no other game offered. Who knew I could come to love a game that wanted to kill me so badly.Ashes, Cinders, and BonfiresAs I fought my way through the story, I began to become immersed with the lore and progression system. Every single item’s description, name, and method of acquisition imparts just a tiny bit of knowledge or history onto the player. At first, most of this information is useless at worst, or intriguing at best. These little puzzle pieces manage to eventually paint a very vivid and dark image about the world of Lothric and its inhabitants. Ashes and unique equipment often detail the previous owners’ qualities; a gift to fans of previous games in the series. Although DS III is fairly disconnected with any of the other SOULS games, certain NPCs and discoveries will tie up loose ends and provide closure for particular aspects of the first DARK SOULS game.Unlike the previous games, bonfires are placed just when you truly need them, and most important of all, teleportation between bonfires are available from the get-go. Firelink Shrine, the base of operations of sorts, serves as the location for player stat upgrades, weapon upgrades/infusions, Estus flask upgrades, and bonfire upgrades (increases healing per flask). Similar to Humanity or Human Effigies from the previous games, Ember heals the player and boosts max health in exchange for allowing human and NPC invasions.Although the world design is fairly spectacular, it was mostly linear/bi-linear (city with a dungeon below it) with moderate exploration required for completionists. The traditionally grand map comprised of interconnecting smaller maps through shortcuts is replaced with a more direct route, however, the world is still HUGE. In fact, without proper investigation, it is extremely easy to completely miss 4 optional areas with their own bosses. In total, there are 19 bosses that will do their best to make sure life in Lothric is a living Hell, along with several other mini-bosses in between. The grunt and fluff type enemies are never too difficult – just strong enough to warrant consistent player attention. The extremely well planned level and boss design (excluding a couple) easily makes DS III one of the most memorable games I have ever played. I can clearly recount most of the paths in every area along with every bosses’ movesets and shenanigans. From clones and body doubles, to massive variances in combat range and aggressiveness, the boss fights and surrounding environements are truly, and remarkably, unforgettable.The Art in KillingOne of the most noticeable changes to the tried-and-true combat involves the introduction of weapon arts. Think of it as a special skill move belonging to certain weapon types. Hacking and slashing is always fun, but turning that long sword into a propeller of death is even more so. Special and boss type weapons are often imbued with properties of their wielder, including a unique weapon art that can be so hauntingly beautiful to perform. Lance thrusts with bursts of electricity, sword strikes covered in fire, and duel-wielded weapons moving in an artistic dance are only some of what you will see. Unfortunately, most of these arts require the use of FP (focus points), and once out, they won’t be usable until replenished.Issues & UpdatesDS III launched with quite a few minor grievances, mostly sporadic FPS drops, but all of them have been fixed. The only major issue at the moment is regarding softbanning due to “Data Inconsistencies” which may occur due to advancing in the game offline (de-syncing with the server) or from online hackers. Continuous patches have been applied since the posting of this review in order to keep up to date with the demanding pvp balance and bug encounters.VerdictI can’t stress enough how much I really enjoyed playing DS III. This game is one of my personal contenders for 2016 GOTY. I really regret never playing the earlier two during their heyday, but at least it gives me something to do while i lament the end of this great journey – at least, until the Season Pass content gets released. For those that want to continue into New Game +, DS III fortunately provides 3 other endings with vastly different consequences to uncover, increasing replayability immensely. One of those endings also requires an extremely strict quest-line progression, ultimately leading to one of the most shocking moments in the game!Before You Buy – analyses of newly released indie games"
    },
    {
        "Recommended": 1,
        "Hours_Played": 54.5,
        "Comments": "Posted: November 1, 2018              Like putting your hand in a blender and watching yourself press the button.However, in all seriousness this is an amazing game. Fun, beautiful, interesting story, it has it all. Co-op is extremely amusing and all the bosses are fun to fight albeit sometimes a bit aggrivating as aren't prepared. I give the game a 9/10, that 1 is just for that one time I died from a cliff"
    },
    {
        "Recommended": 1,
        "Hours_Played": 95.0,
        "Comments": "Posted: July 28, 2016              A white phantom invaded my game while I was fighting some enemies. He watched from afar, clapping and lying down as I ungraciously beat everything around me to death. Once I was done I approached the phantom. He bowed and two-handed a shield. I bowed as well and two handed my greatshield. We fought using only our shields, nothing around us but the sound of clanking and tiny blood spurts as we slowly damaged each other. In the end, I was victorious, but I will never forget you kind shield man."
    },
    {
        "Recommended": 1,
        "Hours_Played": 49.4,
        "Comments": "Posted: February 16, 2017              it's a nice and relaxing game filled with joy and happiness that will make you come back for more!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 101.4,
        "Comments": "Posted: February 24, 2018              I feel a sense of pride and accomplishment."
    },
    {
        "Recommended": 1,
        "Hours_Played": 53.3,
        "Comments": "Posted: September 19, 2017              And Moses said to Ramses: Git Gud, you filthy casul -Revelation 21:6"
    },
    {
        "Recommended": 1,
        "Hours_Played": 63.2,
        "Comments": "Posted: August 16, 2018              **RECOMMENDED AT ANY PRICE.****YOU WILL WANT TO HAVE A CONTROLLER.**one of the best, most compelling games i have ever played.ignore the hype, this game is not as difficult as you've heard, what it is is *extremely unforgiving* with almost no margin for error.it has a steep learning curve and treating this like a standard hackey slashey will get you killed very quickly, and those deaths may cause ragequits - but the game is never actually *unfair*.it is merely extremely unforgiving.you'll get better and as you get better, the game will get easier, because you've become so much better at it.and other games will feel lesser."
    },
    {
        "Recommended": 1,
        "Hours_Played": 417.0,
        "Comments": "Posted: September 4, 2018              === [ Audience ] === ☐ Kids☐ Everyone☑ Casual players☑ Pro players=== [ Graphics ] === ☐ Potato☐ Really bad☐ Bad☐ OK☐ Good ☑ Beautiful ☐ Masterpiece=== [ Price/quality ] === ☐ Full price ☑ Wait for a sale ☐ Don't buy it=== [ Requirements ] === ☐ Toaster PC☐ Minimum☐ Medium ☑ Fast☐ High end ☐ NASA computer=== [ Difficulty ] === ☐ Dark Souls☑ Dark Souls : Git Gud Casual Edition☑ Dark Souls : Git Gud Casual Edition☑ Dark Souls : Git Gud Casual Edition☑ Dark Souls : Git Gud Casual Edition=== [ Game time/length ] ===☐ Really short ( 0 - 2 hours) ☐ Short ( 2 - 8 hours)☐ Few hours ( 8 - 10 hours)☑ Long ( 10+ hours ) (SINGLEPLAYER)☑ Endless (MULTIPLAYER)=== [ Story ] === ☐ It doesn't have one☐ Still better than Twilight☐ Average☑ Good☐ Fantastic=== [ Lore ] === ☐ None☐ Hardly any☐ Average☑ Amazing=== [ Bugs ] === ☐ Game itself is one big BUG☐ Bugs destroying the game☐ A lot of bugs☐ Few Bugs☑ Some bugs but you can use them for speedrunning☐ None=== [ Community Toxicity ] === ☐ Rainbow Six : Siege☐ Mostly toxic community☐ Mostly toxic players but some are helpful☑ Some toxic players but mostly helpful☐ Fantastic community=== [ Should you get it? ] === ☑ Definitely☑ Yes☐ No"
    },
    {
        "Recommended": 1,
        "Hours_Played": 216.7,
        "Comments": "Posted: September 6, 2017              ruined other video games for me. 10/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 53.8,
        "Comments": "Posted: April 5, 2017              10/10 really relaxing and calming game"
    },
    {
        "Recommended": 1,
        "Hours_Played": 88.7,
        "Comments": "Posted: April 14, 2016              Spoiler free reviewIf you didn't enjoy the quality of Dark Souls II and are wondering about the enjoyment of Dark Souls III and the fact that it may be overhyped, worry no longer.Dark Souls III is the true successor to Dark Souls.The third entry in a game series renowned for its outstanding unique storytelling and its sinister difficulty, FromSoftware has brought us again another game worthy of praise. Taking place in the land of Lothric, you will encounter grotesque beasts of the unknown, epic bosses, the most beautiful environments and a lore deeper than any ocean. If you are tired of hand-holding games where the game seems to shove tutorials in your face even to end-game than this is the game for you. Dark Souls is NOT a HARD game.One of the reason that I hold Dark Souls in such high regard is not because of the difficulty but rather the fact that it doesn't treat the player as if they're a child. The game will punish you but know that it doesn't mean the end, rather every death you face is nothing more than a stepping stone to a greater success, a hard earned success is honestly the greatest feeling ever. You will learn new skills and eventually adapt, the game knows you aren't stupid and will treat you like you are; a human, something a lot of games these days are sorely missing.DifferencesAgain, Dark Souls III feels more like a sequel to Dark Souls I than II ever did. Borrowing things from all their previous games you will see happy changes to the overall game. Fans of Demon Souls will be happy to know that the hub world shares an uncanny resemblance to the Nexus as well as the Maiden. Extremely well designed bosses inspired from the creatures of Bloodborne and its engine as well as Dark Souls II's accessibility to the series.Positives:    CAMEOS! Returning characters will make appearances.    Extremely well optimized.    Keyboard and Mouse controls aren't that bad.    There is now no permanent health loss when dying.    Amazing soundtrack that will soothe your ears.    Extremely well designed boss fights.    Full of amazing locations to explore.     Great level design.    Rewarding difficulty.    Playing CO-OP with a specific player is very easy now.    Stances. Combat has been reworked for the better.    No more Soul Memory.    Interesting NPCs, to encounter and converse with.    PVP is better than it ever was.    Classes don't lock you into anything, you can make your build into anything you want, e.g. magic user.    World fits together nicely in a way that makes sense.    Open world, areas are massive.    Approachable systems, deep and very easy to learn and master.    Mage builds are rethinked, they aren't as broken and overpowered like in Dark Souls II.    Matchmaking is a breeze.    This is NOT the final Souls game.    BACKSTABS ARE BACK! At the very least better executed than in Dark Souls II.    You can easily switch between OFFLINE mode & ONLINE mode now.Negatives:    Though rarely, at the moment there is a few framerate hiccups but other than that PC version is very well done.    Somewhat noticeable pop-ins.    The world isn't inter-connected like in Dark Souls I which may upset some.    CAMEOS! Though I've written it as a plus, some may dislike it as some may think of it as lazy where From could've very well created new and interesting characters.    Not necessarily a negative but having an unstable connection while online will bring you back to the main menu.  Is this game worth it?Yes, very much so! Though I am biased, this is truly an amazing game. It doesn't matter if you are a veteran, new or old, Dark Souls III takes the best part of all of From's previous games and makes it even better. It surpassed my expectations, even more it completely destroyed what I should expect from a game. All upcoming games, Triple A especially take note, this is how you make a game. This is a true game.Thank you kindly, Alex for giving me the chance to play this wonderful game."
    },
    {
        "Recommended": 1,
        "Hours_Played": 25.2,
        "Comments": "Posted: September 27, 2018              Fun relaxing game for the whole family"
    },
    {
        "Recommended": 1,
        "Hours_Played": 161.6,
        "Comments": "Posted: July 29, 2016              It's Dark Souls 3 so if you're a fan of the series then you'll know exactly what to expect:- Awesomely responsive and intuitive combat.- You'll die a lot.- An immensely detailed and dark fantasy setting.- Loads of cool weapons and gear to dress your dude or lady up in.- You'll pick up items with vague and cryptic descriptions and think  What the hell is this and what the hell does it do? - You'll die a lot.- It's HARD but fair and nowhere near as difficult as people who don't play the series think it is.- You'll die and shout at your screen something like  daaaaaamn!  and then come back and try again about 25 times.- There will be huge, scary bosses to fight and you'll think to yourself  I'll never beat this  and then on the 10th try you'll beat it (Summon someone to help, no one will judge you) and scream at your monitor.- You'll reach that point in every Souls game where you have to bite the bullet and do some grinding to get STRONGER!- You'll probably spend more time exploring wiki's than playing the actual game."
    },
    {
        "Recommended": 1,
        "Hours_Played": 110.4,
        "Comments": "Posted: April 16, 2016               Positives: + Gorgeous looking.+ Level design is great.+ Massive areas.+ Game rewards you when you progress.+ Difficulty.+ Well designed enemies and bosses.+ Best PVP in souls games.+ Amazing soundtrack.+ NPCs are interesting and well done also their quest lines are pretty fun.+ If you want to CO-OP with a friend it has never been this easy.+ Good and smooth controls. Negatives: - Sometimes framerate drops but not too often.- Areas aren't connected like in Dark Souls I. But it's not a big deal.- IMO some of the bosses need a little buff. Summary As a Souls  veteran  this is the best Souls game in my books this is just amazing piece of work to be honest i didn't even expect this much. FromSoftware did amazing job and hopefully it doesn't end here.This is how you make a game.Buy this game. BUY IT NOW."
    },
    {
        "Recommended": 1,
        "Hours_Played": 238.8,
        "Comments": "Posted: May 31, 2017              The game is cursed, it wont let you leave until you win, which is never. Please help me."
    },
    {
        "Recommended": 1,
        "Hours_Played": 2154.0,
        "Comments": "Posted: June 21, 2018              Spent a few hours on this game, I like it.Maybe you will as well!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 207.0,
        "Comments": "Posted: December 3, 2017              First Run:Get dicked on by every possible combination of player, creature, and furniture piece in the gameGet lost for hours at a time in the swampLearn exactly why Dark Souls is one of the hardest videogames series out thereCome to respect the game's lore, and piece together your quest through vague hints and NPC chatterLearn to love the re-occuring characters, like Siegfried, and PatchesGain a somewhat clear understanding of the parry mechanic, and fight your way to the topNG+Do everything you did before, but as a much more powerful version of yourselfCherish 1-Hitting all the plebs you once thought were powerfulBecome the living god the youtube videos said you could beFinally fill up your ♥♥♥♥ing estus because who the hell finds them all first run anywayDabble in this like sorcery, and easily scale to level 120+Finally get into PVP, and get your♥♥♥♥♥handed to you by some lagging♥♥♥♥♥♥from ♥♥♥♥all, AlaskaNG++This again?I mean, it was cool the first time and all, but this isn't much of a challange.Do what you did the last couple of times, but the bosses take 3 - 5 more hits now.Easily beat your best time, and scale well into level 150+Finally do the optional bosses you were too much of a ♥♥♥♥♥ to face beforeLearn why this community is dying, by getting dicked on by two guys who just farm items by summoning pacts and killing youGiggle, as you can now truly call yourself a big boy.DLCTHIS GAME IS HARD AGAIN AAAAAAAAAHI HAVE TO FIGHT A REAL DRAGON? NOOOOOOOOOOOO9/10 pvp could use some work"
    },
    {
        "Recommended": 1,
        "Hours_Played": 53.6,
        "Comments": "Posted: April 16, 2016              Dark souls III : Door does not open from this side, is a fantastic casual RPG about trying to open doors, realising they do not open from this side, and then trying to find the right side to open the door.There's also a fun mini game about trying to become the lord of cinder10/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 90.3,
        "Comments": "Posted: October 9, 2018              I don't usually write reviews because most people couldn't even bother to read them. Despite this, I would say that this is an amazing game that is surprisingly dead for how good it is!Dark Souls III was my introduction into the souls universe and it was truly an amazing experience.People always say Dark souls is difficult, Dark Souls is hard. But it really isn't. It's challenging. It requires your attention. Masterful architecture, stunning graphics, wonderful level design, full of shorcuts and the fights. The tactical side behind each fight leaves so spoiled that every other game fighting mechanic seems rather simplistic and boring in comparison.Bosses are fantastic for the most part. Every bosses were unique and well designed. TBH the bosses are so good that you feel honored to be killed by them. Each boss has a personality and backstory that makes fighting them either extremely exciting or super sad. One of the most beautiful things about Dark Souls III is the music. The music is simply stunning!10/10 for me"
    },
    {
        "Recommended": 1,
        "Hours_Played": 71.1,
        "Comments": "Posted: April 18, 2018              After you manage to kill Nameless King your IQ increases."
    },
    {
        "Recommended": 1,
        "Hours_Played": 121.2,
        "Comments": "Posted: November 27, 2018              I purchased Dark Souls 3 at full price, knowing very little about it, got to the first boss ten minutes into the game, died like ten times, and immediately got a refund. But I kept thinking about the game, and when it went on sale recently I decided to give it another try. I just kept at it, inspired by the Idle Thumbs playthrough, and now I'm almost 60 hours into this character and I love it. It may be one of my favorite games of all time. Sometimes it's infuriating, but oh man, when you finally power through whatever boss or obstacle is holding you back, it's an amazing feeling. Give it a try and don't give up on the first day like I did the first time I tried it. It's worth it. I'm thinking about getting the DLC and I simply never purchase DLC for anything."
    },
    {
        "Recommended": 1,
        "Hours_Played": 202.6,
        "Comments": "Posted: September 1, 2018              First... allow me to say this:  This is not a review. This is a BIG  Thank You  to all that cool people (white and gold phantoms) who helped me to finish Dark Souls 3! : )Especially, to that very kind player who sacrificed himself as the  Spears Boss .Ok... You still want a review? All right!It is Dark Souls 3 = buy it! Play it! Love it! : )"
    },
    {
        "Recommended": 1,
        "Hours_Played": 49.5,
        "Comments": "Posted: September 7, 2018              farron keep made me suicidal"
    },
    {
        "Recommended": 1,
        "Hours_Played": 66.3,
        "Comments": "Posted: July 13, 2017              125 mental breakdowns, thousands of deaths and 4 corrupted saves later I finally beat the game. Well worth it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 253.0,
        "Comments": "Posted: December 5, 2016              Love video games but hate yourself?Buy Dark Souls."
    },
    {
        "Recommended": 1,
        "Hours_Played": 388.8,
        "Comments": "Posted: September 19, 2016              In the age of estoc, the meta was unformed, shrouded by fog. A land of greatshields, dark swords, and everlasting stamina. But then there were builds, and with builds, came disparity. Strength and dex, int and faith, and of course... fun and tryhard. Then, from the planners, they came, and found the stats for weapons to fit their builds. Straightsword, the first of the playthroughs The Weeaboo Edgelords, and their Blades of Chaos FUGS, the Lord of Damage, and his faithful poise And the furtive caster, so easily forgotten. With the power of builds, they challenged the greatshields. FUGS's mighty blows peeled apart their huge stamina The weebs weaved huge ♥♥♥♥♥torms on the internet Straightswords unleashed a flurry of R1s and kicks And the Hornet Ring betrayed his own, and the turtles were nerfed more. Thus began the Age of Builds. But soon, the meta will change, and only tryhards will remain. Even now, there are only duels, and invaders see not ganks, but endless bows. And amonsgt the PCs are seen, carriers of the accursed Cheat Engine -Rain, discord memelord"
    },
    {
        "Recommended": 1,
        "Hours_Played": 250.6,
        "Comments": "Posted: January 13, 2018              Dies.Dies still!Dies again.Dies repeatedly.Dies 69 more times.Finally beat the boss.Me:  'm awesome at this game."
    },
    {
        "Recommended": 1,
        "Hours_Played": 445.9,
        "Comments": "Posted: May 7, 2016              One needs a certain disposition to appreciate Dark Souls III . A willingness to face setbacks and challenges and then overcome them. Don't expect to play this just like any other action-RPG. Dark Souls 3 is the best game in the Souls series to date. It looks amazing, sounds incredible, plays amazing.If you're going to play this game, it must be on its own terms and as it's meant to be played. That patience will be rewarded with a masterpiece, easily one of the best action and Role-playing games of the year."
    },
    {
        "Recommended": 1,
        "Hours_Played": 517.9,
        "Comments": "Posted: July 22, 2018                Good[■■■■■■■■■□]  9/10---{Graphics}---☐ Masterpiece☑ Beautiful☐ Good☐ Decent☐ Will do☐ Bad☐ Awful---{Gameplay}---☑ Try not to get addicted☐ Very good☐ Good☐ Nothing special☐ Ehh☐ Bad☐ Awful---{Audio}---☐ Eargasm☑ Very good☐ Good☐ Decent☐ Not too bad☐ Bad☐ Earrape---{Audience}---☐ 0+☐ 3+☐ 7+☐ 12+☑ 18+☐ 21+---{PC Requirements}---☐ Check if you can run the calculator☐ Potato☐ Minimum☑ Decent☐ Fast☐ Rich boy☐ Ask NASA if they have a spare computer---{Difficulty}---☐ Just press some buttons☐ Easy☐ Significant brain usage☐ Easy to learn / Hard to master☐ Not so easy☐ Difficult☑ Dark Souls---{Story}---☑ Epic☐ Lovely☐ Good☐ Average☐ Not great☐ Something is not nothing I guess☐ Does’nt have---{Game Time}---☑ Endless☐ Very Long☐ Long☐ Depends on you☐ Not too short☐ Short☐ Long enough for a cup of tea---{ Worth Buying }---☑ Buy now☐ Consider to buy it☐ Worth the price☐ Wait for sale☐ Maybe if you have some spare money left☐ Do not buy it☐ Do not throw money into a trash can---{Bugs}---☐ Never had any☐ Minor bugs☑ Few bugs☐ Some bugs☐ Can get annoying☐ Ruining the game"
    },
    {
        "Recommended": 1,
        "Hours_Played": 2207.4,
        "Comments": "Posted: October 24, 2017              I've played a little bit. Seems alright."
    },
    {
        "Recommended": 1,
        "Hours_Played": 55.3,
        "Comments": "Posted: February 15, 2018              Truly relaxing experience."
    },
    {
        "Recommended": 1,
        "Hours_Played": 93.0,
        "Comments": "Posted: January 10, 2018              5 hours in, I was like  This is so unfair! Why isn't there an easy mode?  and  Ahh!! I hate multiplayer, why won't these evil spirits leave me alone!? .50 hours in, now I'm deliberately under-leveling my character to make it more challenging.  And I'm doing all sorts of online activities like crazy. Dark Souls has the power to convert people, to make you love what you used to hate, and that's a very transformative experience. I'm glad I didn't give up on this game. I hope you don't either. It's going to be worth it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 324.5,
        "Comments": "Posted: September 1, 2018              Before I played: DARK SOULS 3＼＼ ＿　　 ＼( ͡° ͜ʖ ͡°)　　　 <　⌒ヽ　　　/ 　 へ＼　　 /　　/　＼＼　　 ﾚ　ノ　　 ヽ_つ　　/　/　 /　/|　(　(ヽ　|　|、＼　| 丿 ＼ ⌒)　| |　　) /`ノ )　　LﾉAfter I played: DARKS SOULS 3／ﾌﾌ 　　　　　　 　ム｀ヽ/ ノ) 　 ）　ヽ/ ｜　　( ͡° ͜ʖ ͡°）ノ⌒（ゝ._,ノ/　ﾉ⌒7⌒ヽーく　 ＼　／丶＿ ノ ｡　　 ノ､　｡|/　　 `ヽ `ー-'_人`ーﾉGet some balls kiddo"
    },
    {
        "Recommended": 1,
        "Hours_Played": 601.9,
        "Comments": "Posted: April 23, 2017              After years of playing all kinds of video games this has to be the hardest game i have ever played. When you step into dark souls 3 prepare to die alot... this game will make you tilted on a new kind of level. but the feeling when you finally beat that boss or finally clear that area is insane. Thankyou for making dark souls 3 my favorite game ever. i would recommend this game to anyone i know, but i will always give out the warning that this game IS NOT CASUAL. Graphics are great, gameplay is amazing, pve is challenging, pvp is hardcore, the system of invasions is amazing and will make you shiver everytime  you see that message pop up.Overall 10/10 Best game i ever played."
    },
    {
        "Recommended": 1,
        "Hours_Played": 88.3,
        "Comments": "Posted: January 1, 2018              Bought this game just to try and refundWho Knew It Would Be Such a Dangerous AddictionAfter i Bought this played all christmas and still playing,this game wont let u stop.Pros+ This Game is a Bullet Train For Hardcore Gamers+Satisfaction you cant get in any gameConRage Build Up"
    },
    {
        "Recommended": 1,
        "Hours_Played": 72.0,
        "Comments": "Posted: December 19, 2018              This is a great Souls game, and in my opinion, a great game overall. I really enjoy the combat, audio, and if you are able to stomach the fact that the mouse and keyboard controls aren't great, it plays well with a controller.The world design is pretty good, but seems a bit linear. There are connections and shortcuts throughout the game, but the path is still one and you gotta follow it to progress through the game. The ability to teleport from each bonfire is also a proof of the linearity, since it would take ages to move from an area to the other, just by running. The story is told in a great way, for those who take their time to analyze and actually  study  the game environment. Storytelling is done throughout the game by environments, enemy placements, items description, drops, so on and so forth. Basically every element of this game is telling a story. This game is great. Would recommend it? Definitely."
    },
    {
        "Recommended": 1,
        "Hours_Played": 128.5,
        "Comments": "Posted: February 28, 2017              Meet the first boss. Die. Try again, win. Feel the glory of a boss kill, and then realise the game is like this all the way.[T]/"
    },
    {
        "Recommended": 1,
        "Hours_Played": 646.6,
        "Comments": "Posted: October 8, 2018              ---{Graphics}---☐ You forget what reality is☐ Beautiful☑ Good☐ Decent☐ Bad☐ Don‘t look too long at it☐ Paint.exe---{Gameplay}---☑ Very good☐ Good☐ It‘s just gameplay☐ Mehh☐ Starring at walls is better☐ Just don‘t---{Audio}---☐ Eargasm☐  Very good☑ Good☐ Not too bad☐ Bad☐ Earrape---{PC Requirements}---☐ Check if you can run paint☐ Potato☐ Decent☑ Fast☐ Rich boiiiiii☐ Ask NASA if they have a spare computer---{Difficulity}---☐ Just press ‚A‘☐ Easy☐ Significant brain usage☐ Easy to learn / Hard to master☑ Hard to learn / Easy to master---{Grind}---☐ Nothing to grind☐ Only if u care about leaderboards/ranks☑ Isnt necessary to progress☐ Average grind level☐ Too much grind☐ You‘ll need a second live for grinding---{Story}---☐ Story?☐ Text or Audio floating around☐ Average☐ Good☑ Lovley (not explicit though, you have to discover it yourself as you play the game)☐ It‘ll replace your life---{Game Time}---☐ Long enough for a cup of coffee☐ Short☐ Average☑ Long☐ To infinity and beyond---{Price}---☐ It’s free!☑ Worth the price☐ If u have some spare money left☐ Not recommended☐ You could also just burn your money---{Bugs}---☐ Never heard of☑ Minor bugs☐ Can get annoying☐ ARK: Survival Evolved☐ The game itself is a big terrarium for bugs"
    },
    {
        "Recommended": 1,
        "Hours_Played": 220.4,
        "Comments": "Posted: April 12, 2016              Beforehand, I'm running Dark Souls 3 on a GTX 980, an i7 4790K and 8GB of RAM (everything maxed at 2560x1440. Solid 60fps in all areas.) and the game has not crashed, bugged, glitched, trashed my frame-rate, cut my audio or done anything else that is being stated by some users (I'm not claiming that it's not happening, though).With that being saidDark Souls 3 is probably my favorite Souls so far when it comes to gameplay. Combat is fast (not as Bloodborne, but just enough to make things more interesting), fluid and thrilling. Enemies are faster, more aggressive and smarter, too. This time, you have Weapon Arts, which are different skills and movesets for several weapons in the game, that when used, consume Focus Points. Yes, the Demon's Souls Mana bar is back. The level design is SO GOOD this time, although it's not as interconnected as Dark Souls 1, it's big to the point of making you feel lost.  I haven't completed Dark Souls 3 yet, but thus far, it has been one of the best experiences I had since The Witcher 3 came out!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 221.9,
        "Comments": "Posted: September 22, 2018              git gud.(＼　　　　　　　\\　　　　　　　　　　 .／)　 .(ヽ_)　　　　　.ii＿＿　　　　　　 .(_ /)　　 ＼ ＼　　　　i__＿__i　　　　.／ ／　　　　＼ ＼　 　i_-|.|-_i |　　 .／ ／　　　　　 ＼ ＼mi._|_|._,im.／ ／　　　　　　　＼mn｀--´nm.／　　　　　　　　 .i ＼∧／ i　　　　　　　　 i ＜.○.＞ i　　　　　　　　 i　／V＼　i　　　　　　　　 l.ﾆﾆﾆﾆﾆﾆﾆﾆl　　　　　　　　 i　｀ヽﾆﾆﾆ.i　　　　　　　　 il,lni.､ilmi.i,.l　　　　　　　　i:::::::::i::::::::i　　　　　　　　.i::::::::i:::::::i　　　　　　　　　.i.￣ i ￣i　　　　　　　　　 .i＿.i＿i　　　　　　　　　 （＿|＿）"
    },
    {
        "Recommended": 1,
        "Hours_Played": 136.0,
        "Comments": "Posted: August 4, 2017              I invaded a guy called Jesus then i dressed up as in a Cathedral night costume and helped him clear jerusalem from the infidels.Good game 10/10P.s.: Git gud"
    },
    {
        "Recommended": 1,
        "Hours_Played": 69.9,
        "Comments": "Posted: October 14, 2018              Hmm .... Mmm ... oh yea!1. My noobism:I've heard about games from the  souls  series for many years. I've always had an approach to this series like a typical newbie. I never played, I always thought that this game is difficult.I do not have to say HOW I was VERY wrong and how much I have lost over the years.2. ReviewThis game is addictive and satisfying, only some souls-like and rogue-like games can match. However, the games from the Dark Souls series offer an unforgettable atmosphere, constant anxiety, but also fascination and fulfillment.The game offers a lot of combinations of builds thanks to a large number of armor sets, weapons, classes, spells, statistics, fighting styles, and special abilities.There is so much that I do not want to write about it anymore.Regarding the soundtrack, I have never heard the greatest music in the main menu and at some matches, maybe only the one from The Witcher 3 can match. Subtle, motivational, climatic, UNFORGETTABLE!The quality of non-player character voices is the highest class, I have not heard such a good voice act in a long time!Multiplayer is quite specific, can be liked or not. Calling other players to help at the same time exposing yourself to the invasion of hostile players is ... original.Unfortunately, if someone is accustomed to the classic co-op and passing the game with a friend, he may feel a little disappointed. Every time you die and use the checkpoint, you must repeat the monotonous procedure.There are so many secrets to discover, so many connections and dependencies that without a guide you can easily overlook something. Still, I recommend playing this game twice, once for the experience, the second time to test another build, discover the secrets, take part in even more demanding challenges.You can go through this game several times and still discover something and of course still feel satisfaction!Unforgettable defeats and victories, getting to know new opponents, learning new tactics, etc. Everything will stay in my memory for many years!Now I'm able to believe that Dark Souls games can change a human being to a certain extent.Praise The Sun!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 387.8,
        "Comments": "Posted: December 13, 2017              Lore is good.Gameplay is good.Graphics is good.Soundtrack is good.10/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 116.2,
        "Comments": "Posted: April 27, 2018              Took me a while to get into (4hrs gameplay then stopped playing for 7 months) but now it's one my favourite games."
    },
    {
        "Recommended": 1,
        "Hours_Played": 25.8,
        "Comments": "Posted: February 6, 2018              this game is amazing and for only 12bucks on humble bundle get it now!!!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 859.5,
        "Comments": "Posted: April 11, 2016              in this friendly game, you die and then"
    },
    {
        "Recommended": 1,
        "Hours_Played": 129.1,
        "Comments": "Posted: April 13, 2016              The combat is just as fluid as your tears will be."
    },
    {
        "Recommended": 1,
        "Hours_Played": 142.3,
        "Comments": "Posted: May 23, 2017              Beat the first boss on my first try and relatively quickly.Thought I was pretty good at this gameProceeded to get ♥♥♥♥ed a good 10-20 times by some naked samuraiCouldn't beat him in a 1v1 so I resorted to taking myself out and him with me by rolling off the edge10/10 would get anally♥♥♥♥♥♥♥by a katana wielding badass again"
    },
    {
        "Recommended": 1,
        "Hours_Played": 157.4,
        "Comments": "Posted: April 16, 2016              If you're a newcomer to the series, I have a few simple advice for ya.Death is the core mechanic of the game, so dont afraid to die.If you are about to smash your monitor. Quit the game for 30mins or more, then come back and try again. Or try again the next day.Dont cheat and DONT lookup on the internet for guide, maps, tips or weapon location, et cetera.I know Its tempting to googling for all the secrets and hidden paths, or location for all items and armors. But leave that for your 2nd playthrough. The less you know, the more you gonna enjoy the game. I bet on my life that A LOT of people would wish to play any Souls game for the first time again. Lastly, if you havent play the original DS, please do."
    },
    {
        "Recommended": 1,
        "Hours_Played": 36.2,
        "Comments": "Posted: August 14, 2018              1. Prepare to die2. Die, Repeat Step 13. Get gud 4. Become a god"
    },
    {
        "Recommended": 1,
        "Hours_Played": 2996.5,
        "Comments": "Posted: December 30, 2018              You've got a heart of goldDon't let them take it from you."
    },
    {
        "Recommended": 1,
        "Hours_Played": 1300.0,
        "Comments": "Posted: February 4, 2017              Dark Souls 3 is a beautiful game which can be compared to a hot bath. It might be relaxing, refreshing and you enjoy it but it might also be too hot so you burn yourself and die. I really enjoy the feeling when my skin is burning and starts to peel off so I can see my red flesh and bones. Every time the screen says  YOU DIED  my heart skips a beat and I remember why I love this game so much."
    },
    {
        "Recommended": 1,
        "Hours_Played": 122.6,
        "Comments": "Posted: July 22, 2018           Product received for free              Prepare to experience all of the following;Spamming rollTwink InvadersPraise the sunGit gud'Wtf is that?'You diedOverall this game is a ton of fun, especially if you're just getting into the souls series. It is definetly the easiest out of the 3 in my opinion but still has an aspect of hardness and a lot of suprises to be uncovered the further you get into the game. You're most likely going to die at every corner on your first run through but the satisfaction of actually beating the game for the first time is a joyful experience.10/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 3421.1,
        "Comments": "Posted: November 1, 2018              i guess it was okay"
    },
    {
        "Recommended": 1,
        "Hours_Played": 375.2,
        "Comments": "Posted: March 25, 2018              Played Dark Souls: Prepare to Die Edition: Praise the Sun! I mean... Epic and challenging game with likeable NPCs Solaire and Sigmeyer ftw;Played Dark Souls II: Had my first death while trying to jump... Also amazing and more challenging at beginning while you're too used to Prepare to Die Edition. Great playability;Played Dark Souls II: Scholar of the First Sin: Even more beautiful graphics, changes made comparing to the previous one, still the same epicness;Played Dark Souls III: *remembers about the epic moments playing the previous games* ... Man, this franchise is definitely the best! DS3 is also awesome and beautiful, even more challenging enemies and bosses, multiple endings, amazing soundtrack as always, great lore, co-op remains awesome as well... Totally worthy playing it.Thank you, FromSoftware!YOU DIED"
    },
    {
        "Recommended": 1,
        "Hours_Played": 1192.0,
        "Comments": "Posted: July 21, 2018              Try finger, but hole"
    },
    {
        "Recommended": 1,
        "Hours_Played": 894.5,
        "Comments": "Posted: February 18, 2017              700+ hoursThis game is fantastic for new dark souls players, it is more forgiving. but still has the full spirit of a dark souls game, if you quit, you will find yourself coming back to it.The pvp really different from the other 2 games. but its action-packed and full of life. especially when invading post-pontiff. 3V3 all day long.If you are somewhat interested in a decently hard game, you should pick this up and play."
    },
    {
        "Recommended": 1,
        "Hours_Played": 137.6,
        "Comments": "Posted: November 24, 2018              Before playing this I started with first Dark Souls (not on Steam though) and what can I say - I had to spend a few evenings just to complete the tutorial part of the game since I couldn't figure out how to put a shield in the hands of my character and use it to protect myself. Also had no idea there's autolock so you can probably understand by now that this made the game even harder for me than it was designed initially. I swear to god I would abandon this game if I was 11 or something, but being an adult makes you stubborn and gives you that special  I need to finish this  feeling about everything you start doing.I've spent around a year trying to beat the game and had most problems with Ornstein & Smough. Evening after evening I tried to make my character stronger to actually be able to survive this massacre. I played this for a few hours, got despaired and switched to other games. Sometimes I abandoned playing for weeks or even months. But eventually I was able to complete this and it felt like one of the biggest accomplishments in any video game I played so far. I've never had an experience like that before and I loved it.Dark Souls 3 appeared to be less challenging since I was able to call for help anytime I wanted and being lazy in nature I didn't hesitate to do this. It felt like cheating but it's really hard to torture yourself knowing that this can be done in a few minutes with the help of a few pro players. This way I could actually enjoy playing the game and it became more of a relaxing experience since I don't always want to be destroyed in moral way after having a hard day at work which happened a lot at that time. This was also the first time I used the multiplayer aspect of the game and it felt good but also punishing since my fighting tactics usually sucks comparing to what people usually do when they play this game.Overall I feel that DS3 is like DS1 on steroids, at he same time it was easier for me in many ways and I was able to complete it much faster than DS1, which isn't bad but at the same time the fact that I can get help almost any time stole part of the fun I had while playing DS1. The bottom line here is that one definitely should play this game if s/he liked DS1, but I suggest avoiding getting help from other players if you want to get similar experience."
    },
    {
        "Recommended": 1,
        "Hours_Played": 4133.7,
        "Comments": "Posted: October 24, 2016              Solid game.Not as good as Dark Souls 1, but still pretty good.If you loved the old games (you too, Demon's Souls) just like me, you won't say no to this one.Old school Praising, PvPing and chilling with friends. What could go wrong?"
    },
    {
        "Recommended": 1,
        "Hours_Played": 93.5,
        "Comments": "Posted: December 2, 2017              Dark Souls IIIAbsolutely phenomenal game. It's difficult, but as you learn it, you feel rewarded and it becomes incredibly satisfying.Tons of lore and movesets to learn. I wholeheartedly recommend. 10/10 Praise the sun! "
    },
    {
        "Recommended": 1,
        "Hours_Played": 382.8,
        "Comments": "Posted: December 21, 2018              Graphics                                --> BeautifulGame play in single-player   --> Very goodGame play in multi-player    --> GoodAudio                                    -->Very goodAudience                              --> AdultsPC Requirements                  --> High Difficulty                               --> Hard to play solo / Easy to play  with companyStory                                     --> Good Game Time                           --> LongPrice                                      --> Worth paying full priceBugs                                      --> Minor bugsI recommend it"
    },
    {
        "Recommended": 1,
        "Hours_Played": 590.6,
        "Comments": "Posted: May 31, 2018              Played it for a few hours. Woke up dodge rolling to the bathroom. Feels gud."
    },
    {
        "Recommended": 1,
        "Hours_Played": 147.9,
        "Comments": "Posted: August 13, 2016              A very fun stress-free game that will comfort you with its relaxing level design, friendly NPCs, and non-tension inducing environment.10/10 would lie again"
    },
    {
        "Recommended": 1,
        "Hours_Played": 62.2,
        "Comments": "Posted: December 26, 2017              It's like Zelda for sinners."
    },
    {
        "Recommended": 1,
        "Hours_Played": 141.9,
        "Comments": "Posted: April 14, 2017              Yes, indeed. It is called Steam, where the transitory lands of AAA Titles and cheap Indiegames converge.In lagging through pvp, the players discovered the truth of the old words: Git Gud!!11. When the link of the servers is threatened, the trolls toll, unearthing the old Lords of Metagame from their parents basements...Parryking, Saint of the Caestus...Tryhards Unskilled Legion, the Patchnote Watchers...The reclusive lord of the Profaned Poise, Havel the Cosplayer...Only, in truth... the Lords will abandon their Controllers...And the Beginners will rise.Nameless, accursed players, unfit even to beat Gundyr. And so it is, that Noobs seeketh Skill."
    },
    {
        "Recommended": 1,
        "Hours_Played": 149.7,
        "Comments": "Posted: May 27, 2018              I quite enjoyed DARK SOULS III. Although the world is not as branching and connected as DARK SOULS I there are some areas that do have a similar flow to them, where one bonfire joins several paths together through the use of shortcuts. The gameplay is incredibly fast and fluid in comparison to the first two Dark Souls games, something that I was not prepared for during the early hours of the game. I loved the game so much I kept going until I had unlocked every achievement.I know some players took issue with the amount of throwbacks and references to the previous games with recurring characters, locations, and items from the previous two Dark Souls, even Demon's Souls, but I didn't mind at all. The original Dark Souls is the end of the beginning so by the time DARK SOULS III comes around there is an established ritualistic and recursive behaviour in regards to the fading flame. Just like in real life where the world is constantly changing, each civilisation's forgotten history falling victim to entropy, so has the world of DARK SOULS III.DARK SOULS III is difficult but far easier and simpler game to play than the original. Player movement is so fluid and the amount of invulnerability offered when dodge rolling is a huge boon to the player, it's hard not to view it as an exploit. I never bothered with PvP in the previous games but that changed here; after overcoming my nerves I found it incredibly addicting to the point where I'd stay up until 4am messing around as a Mad Phantom just to confuse the players I'd invade.While DARK SOULS III does have its issues in regards to broken mechanics - such as poise not working properly, hackers, and wonky collision systems - it manages to improve on the formula due to some necessary quality of life changes and technical optimisation. I consider DARK SOULS III to be a seriously amazing game, a satisfying closure to the series, and I hope never to see it revived."
    },
    {
        "Recommended": 1,
        "Hours_Played": 149.8,
        "Comments": "Posted: February 19, 2017              Do you think you're good at games?Want to test that?"
    },
    {
        "Recommended": 1,
        "Hours_Played": 102.7,
        "Comments": "Posted: July 13, 2018              Could this be a review?Apprasials: 0"
    },
    {
        "Recommended": 1,
        "Hours_Played": 234.0,
        "Comments": "Posted: December 15, 2016              Darks Souls 3 was the first Souls game I had ever played, so I wasn't quite sure what to expect. I expected a difficult journey (though I wouldnt know just how difficult), and gameplay similar to games like The Witcher, Skyrim, or Dragon Age. What I ended up getting was a game that made me feel like I was handed a sword and told to explore this insanely unforgiving, relentless, and utterly merciless game. A game that makes you feel like you were handed a sword.Imagine if - with all your years of fantasy game experience - you were handed an actual sword and told you face this world. Do you think you would be good? No, we would all mostly get pounded left and right. This is what Dark Sousl 3 does to you. It's not your typical fantasy, where you feel like you know how to play and  you got this . Dark Souls 3 casts a feeling of helplessness and feelings of unfamiliarity into a seemingly familar journey. Dark Souls isn't your average hack and slash fantasy but a dark, dark, unforgiving bully that will never spare you. This game will kick your legs in and then continue to kick you while you're down, and it couldn't be better. Not only are the graphics impeccable, the mood is enough to make you go wow. Not only that, but learning about the lore could be a game on its own, deeply sown within each item description, enemy, and place you visit, are inklings of game plot and lore.Bosses are relentless and will slaughter you and your dreams with brutality and the strength you wish you had. You will be crushed time and time again, but this game is like drugs, and you will continue to come back for more, whether it be for vegeance, pride, or anger. There are so many weapons to be found, views to be sought out, friends to be made, people to rescue, magic to learn, bosses to defeat, stories to be heard, secrets to be discovered, blood to be bled, and souls to be lost.Your armor will be your comfort, your weapons will be your arsenal, your spells will be your plan B. You will nervously dodge, fail to parry, attack too early, attack too late, miss attacks, run out of stamina, and desperately run,  this game is like bootcamp.I recommend Dark Souls 3 to anyone who is a fan of the Fantasy genre, likes a challenge, isn't afriad to back down, and has the vigor to push on. Praise the sun!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 107.7,
        "Comments": "Posted: January 19, 2018              Yes, there's fan service, I could have used a lot less.Yes, there's no actual innovation to be found here.Yes, the graphics are not technically top notch.Yes, the sound and effects could use some polish and can be laid on a wider spectrum.But there's something about how Dark souls does  End of the world  like no other game can.There's something about the broken places, obsolete faces, rusted armor, tired gait, collapsed ruins.And it takes you through a different experience, where there is huge potential for you to fill up the blanks and make your own interpretation of the world.It is the journey that matters here, not the destination.Hidetaka Miyazaki, take a bow."
    },
    {
        "Recommended": 1,
        "Hours_Played": 157.0,
        "Comments": "Posted: November 2, 2016           Product received for free              I have fulfilled my masochistic needs in this game. Fully recommend it for those with low self esteem and crippling depression.This game gave me pure agony I truly deserve."
    },
    {
        "Recommended": 1,
        "Hours_Played": 218.9,
        "Comments": "Posted: June 25, 2018              After all those hours spent in the game i can say...the first boss is finally dead."
    },
    {
        "Recommended": 1,
        "Hours_Played": 191.3,
        "Comments": "Posted: October 16, 2017              Q: Give me a TL;DR version.A: Buy the game and git gud.Q: I heard the game is hard. Is it good for causal player?A: Yes.Q: Is it good for Skyrim player?A: Yes, but you'll need to learn new mechanics such as parrying and roll timing.Q: Is it a good game for family, friend etc?A: Yes. The game has a password feature to co-op with friend. I think the game is educational for children, as it teaches people to not give up and overcome hardship.Q: Is this game full of rainbow and candy?A: No, it's closer to a horror game, especially in some later areas. Even prettier areas are infested with monsters. The atmosphere of this game is very grim and grey-ish.Q: Tutorial?A: Check the signs in the first map. You can check the keyboard-controller maping in setting. The first map has mooks, a mini boss and a boss for you to play with. The tutorial boss, Gundyr, teaches you various evasion technique.Q: Is there a mini map?A: No. But since you might die a number of times you'll get familiar with the map. There are many shortcuts.Q: Is there an easy mode?A: It's called greatshield, you can get one in the second map but need some levelling up to use it. Starting as knight (default) also counts as an easy mode in early game.Q: I don't like invaders.A: Start the game in offline mode, you can change this in setting. You can still play with NPC phantoms but cannot co-op. If you are online, stay unembered prevent invasion but you cannot co-op. If you are invaded you can also run toward the boss fog gate. Edit: you can join Way of Blue in the second map, that will lower the chance of being invaded as well.Q: Mooks attack 100 times in a row.A: Try spacing.Q: Mooks gank me. Unfair!A: Try looking around, this game is known for enemy trolling you every corner. Lock on feature will spot enemy above.Q: Bosses are too fast.A: It's kind of counterintuitive, but you sometimes need to roll toward them. Check Youtube if you have trouble. Don't worry, dying to boss is a learning process.Q: What's the main strength of this game?A: Best video game soundtrack.Q: What's the weakness of this game?A: Too short compared to DS2, not enough armor/weapon/spells.Q: Should I buy DS1 and DS2 instead?A: DS1 is more noob friendly IMO, and a better defined story. DS2 has many different mechanics, better PvP but terrible PvE ganking. It's completely up to you.Q: Will I feel confused by the story when jumping directly into the third game?A: The story is always vague, so it doesn't matter. Check Youtube lore channels for better understanding.Q: I've heard that NPC questlines are hard to complete without guide.A: Just talk to people and do what they say, check the shrine to see if there are new dialogue. One thing you need to remember is that progressing in Rosaria's Finger (a guild, you cannot equip the guild item or offer the leveling item) will end another questline. Also the magic merchant will leave if you ignore your promise.Q: I'm a completionist. What if I miss some gear?A: You need to reach NG++ for 100% achievement, so feel free to look online for checklist in NG+."
    },
    {
        "Recommended": 1,
        "Hours_Played": 65.1,
        "Comments": "Posted: March 6, 2017              This game is an abusive relationship that you cant help but go back to 10/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 158.9,
        "Comments": "Posted: November 22, 2017              How to describe this game ? Simply! You kill some enemies, find some loot , you run around screaming because a big thing is chasing you and you die by rolling off a ledge by accident............Fun!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 67.0,
        "Comments": "Posted: December 11, 2016              OK , so I've just beat the Dragonslayer Armour and had left with 9 etsus flusks and 0 FP.I reach the next bonfire which is pretty close , I light the bonfire but I don't rest at it , because there is a summon sign.I summon this  Myla the Thief  which I though at first that it was an NPC  but a few seconds he/she jumps around near the elevator contramption which is near the bonfire and I realize that thief is spelt wrong and that he/she is a player.He/she collapse and then starts to go ahead in the Grand Archives we fight with the Crystal Sage and the other enemies which are new to me , even the hands on the bookshelfs were weird because I didn't use the Wax.While we fight and advance I start to notice that  Myla   was using only a small dagger and he/she was showing me to use the hidden ladders and levers , he/she even showed me the part where are the gargoyles outsides.We get outside of the library and he/she collapse , I though that it was because of the statue and that it was something about the story , a few seconds later I realize that we are attacked by 2 NPCs who look human , 1 second later I noticed the archer too . We win the fight against this trio and proceed further to the bridge with the stairs where I was close to die a few times , yet we reach the end of the stairs and there is a room with a fog wall.I saw a summon sign so I summoned it , it was  Sirris of the Sunless Realms  a true NPC .I go through the fog and soon they come too, we fight with this boss  Lorian,Elder Prince  where I was trying to learn his mechanics , finally we won .Or at least that's what I though , the  we won  wasn't actually a win because the boss wasn't dead , it was only the first phase of it .We looked doomed , Sirris  was almost dead and I had only half of hp , 1 etsus flusk and  1 divine blessing. But we fight and fight , I get knocked a few times by the mechanics which I didn't knew. Yet  Myla  was fighting with his/her dagger a boss  whom he know that it was my first time. We tried to aggro the boss , one by one , he was hitting him a few times , getting his aggro and then I was doing the same trying to do my best.Even if it looked over I fought with only 20% hp while the boss had half on the second phase.In the end our struggles pay off.The boss is dead , we rejoice with our gestures and spamming the animation for the empty etsus flusks.While I light the bonfire I realize that I had 261320 souls and later I realize that I've just beat the last Lord of Cinder  Lothric, Younger Prince  whom he was in phase two of the boss.And this my friend is the story of my CO-OP journery in Dark Souls 3 with a  Thief  whom had only a dagger, a journey that I won't forget so soon.Edit:Fun fact :I had my Estus Flask at +0 ,because I didn't knew that you could make + (Later I've found out through some wiki)"
    },
    {
        "Recommended": 1,
        "Hours_Played": 4914.2,
        "Comments": "Posted: August 6, 2018               Ok for an hour or so"
    },
    {
        "Recommended": 1,
        "Hours_Played": 920.7,
        "Comments": "Posted: February 8, 2017              I hate this game.10/10 would recommend."
    },
    {
        "Recommended": 1,
        "Hours_Played": 920.7,
        "Comments": "Posted: February 8, 2017              I hate this game.10/10 would recommend."
    },
    {
        "Recommended": 1,
        "Hours_Played": 5.4,
        "Comments": "Posted: October 1, 2018              Watched my kids play hours and hours of Dark Souls. They were very good. Game looked awesome. I love games. I own 300+. Kids said  dad, you have to get Dark Souls.  I said  I have to get Dark Souls.  I got Dark Souls. I've played 5+ Hours. Still haven't beaten the very first boss. Kids looking for new dad."
    },
    {
        "Recommended": 1,
        "Hours_Played": 12.4,
        "Comments": "Posted: September 10, 2018              This is definitely one of the hardest game i have ever played. But if u like to torture yourself than this game is for u."
    },
    {
        "Recommended": 1,
        "Hours_Played": 87.0,
        "Comments": "Posted: January 30, 2017              I like the variety of weapons and armour, and that the heavier weapons feel meaty when you swing them around. The combat (which is the real 'meat and potatoes' of the game) is great fun, challenging yes, but the game is designed in such a way that its almost always worth one more go.You try, you fail, you improve slighty, repeat 5 times, achieve success, dopamine is released, you realise its 2am, you feel shame."
    },
    {
        "Recommended": 1,
        "Hours_Played": 505.6,
        "Comments": "Posted: July 1, 2016              PvP ==> DS2PvE ==> DS3Lore ==> DS1"
    },
    {
        "Recommended": 1,
        "Hours_Played": 252.9,
        "Comments": "Posted: April 13, 2016              There is beauty in death"
    },
    {
        "Recommended": 1,
        "Hours_Played": 103.7,
        "Comments": "Posted: July 10, 2017              I cannot say much of anything which has not already been said about this game. But who can stop the provocated hands of a writer? I can add scarcely anything but praise which already exists in excess for this game. But, as a newcomer to the series, this review, then, by default is primarily, though not exclusively for newcomers such as myself.Everything about this game, from the gameplay, the graphics, the vague PvP, to the yet vaguer story/ lore is something intense, something which stands apart from the vast array of titles which are paraded onto the digital and retail marketplaces. And although everything about this game is intense, nothing seems forced.. The voice acting done is insanely good, I mean, there are splendid baritones of the men and also the soft lullaby voices of the women.It is simply a treat to walk through the world of Lothric, 'a land of monstrosities', which is a world fallen into ruin. Not just the visuals but also the music is simply amazing, just perfectly fitted for each moment, there exists a piece of music for this game.Dark Souls III does everything well, including its silence, we...are silent, we speak nothing, we have no voice and it would be a joke to call ourselves the protagonist, we are just an undead on a forsaken quest for which we won't be thanked or remembered. It brings out the stark and lovely misery, in many ways, it is much like real life struggle of real life heroes. Some of the stories, nay, most of the lore of the bosses and NPC's are deeply moving, and there exist a plethora of videos on YouTube if you want to delve deeper into their sorrow and mull and wallow in sadness. The choice of weapons, armour is also something worth mentioning. You can even don the armour of the bosses you defeat which also plays a part in the greater irony of the world. And yet more tragic, in some sense is the soul transposition concept with which we can make weapons out of the souls of the bosses we fell.But the defining characteristic, the thing for which even casual gamers such as myself reach back time and again into the game, is the GAMEPLAY, which is absolutely brilliant. It cannot be compared to anything, things are, indeed compared to the SOULS gameplay. The combat, the management and investment of stats (RPG perspective), the quests you take, the friends you make, the routines you break...Each button press, each light attack, each special move, each dodge, each and every movement and action that you make the character do is important, it is more than a pattern, it is not merely repetition, it is getting skilled, gaining confidence and familiarity and then going in and getting through which fills you with fulfilment and contentment.Even the abstract lore and story is presented in such a poetic and beautiful way that one cannot help but probe further into it, through the sources which the game itself provides, stringing together clues, piecing together fragments of scraps from descriptions and dialogues. But the curiosity which is invoked by the subtlest of hints is something which made me, at least become a fan of lore videos which plentifully plague YouTube.The essence and SOUL of Dark Souls III lies in the way it retains its uniqueness despite everything being compared to it. The only con, I think, is that nothing really, can live up to the Souls experience...and that, like almost everything that we truly love, is tragic."
    },
    {
        "Recommended": 1,
        "Hours_Played": 381.2,
        "Comments": "Posted: February 17, 2017              Took me 2 hours for the first boss10/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 218.0,
        "Comments": "Posted: March 27, 2017              I am never been this relaxed while playing a game. Its like listening to orchestra while having a massage. Feels great really recommend this game for people who want to relax their mind and body."
    },
    {
        "Recommended": 1,
        "Hours_Played": 131.3,
        "Comments": "Posted: November 12, 2018               Ashen one, be sure to bring more souls. To start this game after a few months of break,is like if you meet your childhood love after long years.■■■■■■■■■■ 10 / 10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 259.5,
        "Comments": "Posted: August 5, 2018              This game is like anal,Hard and Painful, but you'll get used to it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 2338.5,
        "Comments": "Posted: October 16, 2017              After almost 2 years since FromSoft gave us DS3,there is no true challenger for this game.The single player experience is unique with great areas and hard boss fights.Pvp is very good and again FromSoft add for us some advanced mechanics (and i'm not talking about weapons art) makes it's very interesting.Overall Dark Souls 3 is a must have  for players who want's more challenge in their experience of playing a game"
    },
    {
        "Recommended": 1,
        "Hours_Played": 1151.7,
        "Comments": "Posted: June 6, 2016              DARK SOULS PVP NITPICKING - EVERYONE HAS ALREADY COMPLAINED ABOUT THIS  EDITIONGRAIN OF SALT WARNING: This post is by an idiot who played over 1000 hours of Dark Souls 2 and Scholar of the First Sin, most of which were PVP hours at the upper soulmemory tiers.As far as PVE goes, it's pretty good!  Nice places, wide selection of weapons from the get-go, you know the drill.  Everyone is basically in agreement that the PVE is a return to DS1 form and is generally lovely, though personally I think the locations are not quite as fantasy-tastic as DS1 or DS2.  Personal opinion there; YMMV.The PVP is another matter.  Again, fair warning; some of these might just be my cheese being moved, but as a guy who got to know the combat in DS2 fairly deeply, I am annoyed that a lot of clever things were disposed of.  It's not a world-shatteringly terrible affair, but it seems curious to me that several of the lessons FromSoft learned from DS2's two-year-long PVP balancing fiasco were either forgotten or ignored, including but not limited to:- No weapon turncaps.  Any weapon can track a full 180deg after the first attack; in DS2, things like thrusting swords and spears had their tracking limited so that their advantages (range, speed) were offset by poor tracking; without these restrictions, these weapons become much stronger since their narrow hitbox will almost always be where you want it to be without punishing you if you are wrong.- Faster combat.  This is not a bad thing!  The way it interacts with the famously spotty netcode is.  Certain weapons have very fast running or rolling attack animations, and a poor connection can lead to you not even seeing several initial frames of an attack, making certain weapons irritatingly overpowered (I'm looking at you, katana running attacks (and the people who play (very successfully!) with nothing but this one attack)).  This also makes phantom range a bigger problem than it was.- No poise.  I know  poise  is in the game as some bizarre mechanic that governs i-frame loss, but that is some small potatoes.   Hyper-armor as a general purpose poise replacement is not all bad; it makes some STR-focused weapons very viable, but certain fast and light weapons (estoc, duh) are more effective than anything else simply because they can be doing damage before you have a chance to get to your weapon's hyper-armor frames as a counter.  Personally, I find this problem is the worst with the Farron Greatsword - its weapon art move hits for a decent bit of damage and is a guaranteed stunlock, but the stun comes long before the damage thanks to the myriad of hits apparently accomplished by breakdancing.  The weapon effectively has a fast weapon's hitstun timing and a midsize weapon's damage, which is an irritating pairing when added to the eons long stunlock.- No backstep iframes.  I straight-up don't see people backstep anymore.  I'm a proponent of the  more options/higher skill ceiling  school of thought, and though some people exploited backsteps to the point of being irritating cheese in DS2, I miss having a good portion of my weapon's moveset being viable and not just an extended, predictable setup.  With the faster combat/netcode combo, nobody can expect to evade a hit from another player with a backstep since they'll just hit the space where you were, doing damage without fail.- No aimable running attacks or backstep attacks.  You could do some really nifty stuff with large weapons and manually aiming backsteps and running attacks, but now running attacks are only PVP viable with very fast weapons.  Certain weapons with a running charge for a running attack have a teeeeeeeny allowance for changing direction, but it's so small that it's trivial.  Combine this with no iframes for backsteps and you lose a lot of options for skilled play.- Nerfed offhand moveset.  In DS2, you could do any attack with your left handed weapon that you could with your right, excluding ripostes and other crits.  Now, the only moves your offhand weapon can perform are light attacks and either a guard or a parry (or spells but that's obvious) depending on what you have equipped.  Curiously, when equipping a weapon with an offhand parry move, L1 attacks and L2 parries as expected, but when using any other weapon, L1 guards and L2 is the attack button.  Why FromSoft thought anyone would want to guard with a 1handed weapon or have the input commands mixed up like this is completely beyond my ken.  Again, less options.- No attack cancels.  This sword cuts both ways; you don't see the game or players doing something that obviously shouldn't be possible, which is a pet peeve of mine that I grudgingly put aside for the sake of fun, but you also miss out on a lot of headgames that ultimately decide fights between skilled players.  Cancels were the redemption of large weapons in DS2, and while hyper armor on any weapon larger than a stick is not a bad tradeoff, it still feels like the easy way out as far as making big weapons viable goes.  Less options!- Nerfed guard-breaks.  This seriously rewards extremely defensive play which is SUPER BORING and exhausting.  Greatshields are supposed to be great at being shields; that's perfectly fine!  To not be able to counter one without a whip is not fine.  People did perfectly infuriating jobs of being obnoxious and effective turtles back in DS2 when one guardbreak could swat the shield aside, and now it is much much easier.- Removal of several key gestures.  This might seem trivial, but a large portion of a player's  vocabulary  was nixed for some reason.  There are now a million ways to say  Hello!  and  I'm a smarmy jerk!  Look at how bad you are!  but FromSoft removed the ability to say  No  with the No Way gesture, they removed the Mock gesture which was a great way to express confusion, they removed the It's Me! gesture which was the best thing since sliced bread, and they removed the Righty-Ho! which was just great and I miss it.  At least we got the clap and the  here's my elbow  and anri's pretentious slow-walk emote!- Broken Covenants.  This doesn't affect everyone, but IT AFFECTS ME AND I AM AS CHEESED AS I CAN BE ABOUT A SMALL PORTION OF A VIDEOGAME.  Basically, some people get summoned to covenants that autosummon you and some people just don't, and apparently it's determined by the steam account that owns the game, primarily affecting early purchasers (as far as I can tell).  Move your file over to family sharing and there's no problem, but this should not be considered a fix and I'm not even sure if it violates the EULA or not so I haven't bothered.  Point is, getting certain covenant rewards is unreasonably tedious for some as a result, myself included.----------------------------These are my major gripes that I think could find broad acceptance.  My minor gripes are FAR MORE IMPORTANT.  Obviously.----------------------------- No bell on a stick and my amazing greathammer 1handed rolling r1 is gone from all greathammers.- No statue on a stick and everyone just circles around the edge of the Pontiff's arena doing nothing.- You can't stand still and turn with a drawn greatbow anymore; the game just interprets this as you getting antsy and takes you out of the draw animation.- I used to be able to play with friends I made in Australia.  Now it is as though we send packets via smoke signals.- NO RUIN SENTINEL SET OR ANY OTHER SET WITH A HELM THAT A HUMAN HEAD COULD NOT POSSIBLY FIT IN.  COME ON, FROMSOFT.  WHERE'S MY GOOFBALL AWESOME GEAR?????I'd still say buy it because I'm an addict and a slave with nothing else to play, and chargeable attacks and weapon arts are the bees' knees.  If you like masochism and hating the thing you love, then the newest Dark Souls is still for you!These are still the developers who, in DS2, had the bewilderingly enormous stones to buff the Chaos Blade on April Fools' Day and leave it that way.Hooray!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 224.7,
        "Comments": "Posted: February 28, 2017              I still don't understand why the heck I just started playing this extraordinary game after it had been released for nearly one year. The game is perfectly designed for those who love hardcore games and who would like to constantly seek endless challenges. Even though I have just played through some of the levels and have already died many times, I cannot wait any longer to give the game a positive review."
    },
    {
        "Recommended": 1,
        "Hours_Played": 2780.3,
        "Comments": "Posted: April 7, 2018              i played it at bit....it's ok"
    },
    {
        "Recommended": 1,
        "Hours_Played": 1837.1,
        "Comments": "Posted: May 12, 2017              Played a bit, kinda good :D"
    },
    {
        "Recommended": 1,
        "Hours_Played": 81.7,
        "Comments": "Posted: June 27, 2017              10/10 Would die again"
    },
    {
        "Recommended": 1,
        "Hours_Played": 513.9,
        "Comments": "Posted: January 16, 2017              im almost done making my character"
    },
    {
        "Recommended": 1,
        "Hours_Played": 126.3,
        "Comments": "Posted: April 20, 2018              Cried a bit in the first days, but then i got better just accepted to love the  you died  screen.This game will change you, and the way you play any other games."
    },
    {
        "Recommended": 1,
        "Hours_Played": 846.5,
        "Comments": "Posted: July 8, 2018              So sick, I just beat the first boss, literally shaking right nowCan't wait to see what the rest of the game will bring"
    },
    {
        "Recommended": 1,
        "Hours_Played": 268.2,
        "Comments": "Posted: December 10, 2016              Dark Souls bosses are like dating beautiful girls. First they feel impossible but once you learn their patterns, weaknesses you can easily take their souls. Forge their soul into a weapon and face (date) harder (more beautiful) bosses (girls).10/10 best dating simulator."
    },
    {
        "Recommended": 1,
        "Hours_Played": 687.9,
        "Comments": "Posted: June 27, 2017               Yay or Nay? Well...Gameplay: Skill-based. Not for casual players.Graphics: Excellent!Sound and Music: Couldn't ask for more.Story: The lore is very detailed and immersive.Price: Worth full price if you're a DS fan.Achievements: most of them will pop while playing, but some of them require grinding. Final verdict: Hell Yay!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 170.9,
        "Comments": "Posted: May 4, 2017              11/10 would rage again."
    },
    {
        "Recommended": 1,
        "Hours_Played": 119.2,
        "Comments": "Posted: August 8, 2016              ||UPDATED FOR THE ASHES OF ARIANDEL DLC RELEASE|| PROS: +Eerily atmospheric and detailed game world.+Fluid attack and movement animations.+One of the best line-up of boss battles in Souls' universe, who now have two phases.+Retains From Software's signature style of lore-building+Complex NPC side-quests.+Haunting soundtrack.+PC Version is fine with little, ignorable problems. (Like FPS drops while connecting/disconnecting controller...yeah) CONS: -Considering the last Souls' games' excellent DLC lineup, DS3's first outing is a little disappointing. Except ONE awesome boss and 6hours to offer, it falls flat.-PvP and Covenant system is a step down from Dark Souls 2.-Weak NG+ content.-Some of the features have been streamlined  , to make newcomers comfortable, which include but not limited to:    Removal of AGILITY stat. Unable to upgrade armor.Forced levelling-up by visiting hub area  POISE!!!!  I don't know what is that. Does it exist? Not anymore.Ability to change covenants anytime, anywhere. You can now move while chugging Estus flasks. While it's neat design in Singleplayer, it's a nightmare to begin with in PvP. - GREAT LEVEL DESIGN! SUPERB! TOP NOTCH! 9/11  While it definitely is better than the linear design of DS2, it's not anywhere close to Dark Souls 1. Somewhere inbetween those two games. VERDICT: You cannot shake the feeling that this game was supposed to be a love-letter of sorts for Dark Souls fans. There is a lot of fanservice and referencing that will intrigue those who spent massive chunks on time on the first game. Inspite of some notable changes, like addition of a focus bar, weapon arts and faster attack animations, this still feels like Souls game. Inspite of somewhat dumbed difficulty and fluctuating brilliance of level designs, I had tons of fun with Dark Souls 3.This is a MUST buy for any fan of the Souls' series or challenging RPGs in general. Definitely a formidable GOTY candidate this year."
    },
    {
        "Recommended": 1,
        "Hours_Played": 847.7,
        "Comments": "Posted: June 8, 2017              It's a really boring game. I got bored after I played for only 800 hours. I'd rather choose to play minesweeping for 800 hours."
    },
    {
        "Recommended": 1,
        "Hours_Played": 115.2,
        "Comments": "Posted: April 14, 2017              I keep screaming but God won't answer."
    },
    {
        "Recommended": 1,
        "Hours_Played": 25.0,
        "Comments": "Posted: January 5, 2018              ===[ ❤ Audience: ]=== ☐ Kids☐ Everyone☑ Casual (CASULS) players☐ Pro players===[ ☼ Graphics: ]=== ☐ Potato☐ Really bad☐ Bad☐ OK☑ Good ☐  Beautiful ☐ Masterpiece===[ $ Price/quality: ]=== ☑ Full price☑ Wait for sale☐ Average☐ Refund it if you can☐ Don't do it===[ ☣ Requirments: ]=== ☐ 90' PC☐ Minimum☑ Medium ☐  Fast☐ High end ☐ NASA computer===[ ☼ Difficulty: ]=== ☐ You just need 2 arms ☐ Ez☐Easy to learn / Hard to master ☐ Hard (first few hours)☑ Dark Souls===[ ۞ Game time/length ]=== ☐ Really short ( 0 - 2 hours)☐ Short ( 2 - 8 hours)☐ Few hours ( 8 - 12 hours)☐ Long ( 12+ hours)☑ Endless===[ ♬ Story] === ☐ It doesn't have☐ Still better than Twilight☐ Average☐ Good☑ Fantastic===[ § Bugs ]=== ☐ Game itself is one big BUG☐ Bugs destroying the game☐ Lot of bugs☑ Few Bugs☐ You can use them for speedrun☐ Nothing===[ ✦ Others: ]=== Multiplayer: Yes (Others can invade your world and others can join it)Singleplayer: Yes"
    },
    {
        "Recommended": 1,
        "Hours_Played": 360.7,
        "Comments": "Posted: March 15, 2018              Fun"
    },
    {
        "Recommended": 1,
        "Hours_Played": 339.1,
        "Comments": "Posted: April 11, 2016              the bosses are so good that you feel honored to be killed by them"
    },
    {
        "Recommended": 1,
        "Hours_Played": 60.6,
        "Comments": "Posted: August 24, 2016              There is a man named Brian.I told him to try out DS2.Brian did not enjoy DS2.Brian decided to try DS3 when it released.Brian was having difficulty but, enjoying his run.I told him  in order to beat dark souls you must first be broken by dark souls. it is only when you have given up and you fight with the last shred of willpower can you overcome the obstacles before you.  This game taught an impatient man that bum rushing is not a valid tactic.Brian no longer requires my help to defeat bosses.This game literally changes your life.it teaches you to... git gud.Hi my name is Andrew and I am a Dark Souls addict/enabler.I ruined Brian's life, he is no longer satisfied by other games."
    },
    {
        "Recommended": 1,
        "Hours_Played": 323.0,
        "Comments": "Posted: April 11, 2016              To preface this, I bought and played the japanese version on ps4 to completion already.  I cleared the game 4 times on 3 different character builds, and have invested around 85 hours so far.  This is my opinions based on that.This is honestly my favorite game of all time.  I love the souls series, and with over 1300 hours put into the other 4 games, this has instantly become my favorite of them.  If you take 35% Demon's Souls, 35% Dark Souls, 15% Bloodborne, and 15% Dark Souls 2, then combine them into one, you will get Dark Souls 3.Starting off, what the game takes from Demon’s Souls is the tight, sprawling, atmospheric level design, as well as many other references, callbacks, and influences.  From the original Dark Souls, you have incredible bosses, music, NPCs, visually stunning vistas, and interesting lore.  This game feels more like a sequel to Dark Souls 1 than 2 did, with direct references to the game, as opposed to 2's way of saying that  something happened long ago .  From Bloodborne, take the detailed environments, visually impressive graphics (thanks to a new engine), and a dash of enemy and boss designs.  Finally, from Dark Souls 2, take the massive quality of life changes, that make the game more accessible in a positive way.Pros:+Excellent gameplay, with a combat feel and speed similar to Dark Souls 1 and Demon's Souls.+Tons of content, with over 150 different weapons, a wide array of armor sets, and solid amount of spells.+Extremely detailed and varied world, with attention to level design and smart world building.  Like Dark Souls 2, the game covers a lot of horizontal distance.  However, the world fits together in a way that makes sense.+The levels are also massive, with some single areas taking up as much space as multiple areas from other games.  There are many paths, shortcuts, and secrets in these giant levels.+Approachable systems, such as a very simple yet deep upgrade system, where weapons can be upgraded to +5 or +10, and infused with a element or scaling path, similar to Dark Souls 2.  However, the paths are much more interesting, such as a strength scaling, quality scaling, luck scaling, and many other paths, in a very Demon's Souls-y way.+The return of exclusively using estus to heal.  No more lifegems or blood vials.  There is a Dark Souls 2 system of upgrading the estus, however you start with 4 charges instead of 1.  Divine blessings still exist but are very rare and you can only carry 1 at a time.+I was personally not disappointed by a single boss, area, or enemy in the game.  There was no drop in quality like Dark Souls 1, lackluster areas like Dark Souls 2, or annoying, tedious grinds, like Bloodborne.  There was a smooth difficulty curve that increased as the quality of the areas and bosses did, all the way to the end of the game.+Mound makers is one of the coolest covenants in a souls game.  The way they work is to leave your white sign, however when you are summoned you are hostile to the host, summoned phantoms, invading phantoms, and enemies.  Your task is to kill a phantom of any kind, so they act as a sort of wild card.  Every encounter I have had with mound makers has been a fun time.+The matchmaking, at least on ps4, has been incredible.  Very similar to the speed of dark souls 2, but with the password system of bloodborne.  Multiplayer with friends is very fast, and can be done immedietely after the tutorial boss.  The pvp also takes a 2 hit combo system from dark souls 2, where it's relatively impossible to get stunlocked to death unless you get ganked.  Backstabs are also a non-issue, unless possibly the other player has a horrible connection.+Amazing soundtrack, one of the best in the series.  So many good songs.However, there are a few problems that some may have with the game:-Magic is pretty hard early game, other than maybe pyromancy.  When trying to play a mage, you have a lot more stats to focus on, and it takes a very deep investment in faith or intelligence for spells to get really strong.  I played a magic character as one of my characters, and I constantly struggled with whether i wanted to upgrade int for better spells/damage, attunement for more mana and spell slots, str/dex to get a better backup weapon, and health since you start with extremely low health.  The cast speed also feels really slow, and you can't cancel casts.  With an increase in aggression, and low health, starting as a spellcaster is very challenging for the first third of the game.  It is doable however, and by the end of the game is very viable and will hit very hard.-Encounters take a very ambush-y and gank-y approach to them.  This is not a bad thing for me personally, but I know a lot of people dislike this method of approach, and there is a lot of it in Dark Souls 3.  With magic being as slow as it is, it makes playing a mage even harder than it already was.-The world is not interconnected like Dark Souls 1 is.  There are no inter-level shortcuts and areas with multiple entrances and exits.  This is a non-issue for me, because the level design was so good that it didn't matter to me.  However, I know that one of the biggest draws for people regarding Dark Souls 1 was how the world was connected.  So this will be a negative for a lot of people.-There is a lack of interesting covenants to take the place of the ratbros or gravelords.  Most of the covenants have a typical function.  Coop, invasions, or protection of a host/area.  This is a let down, as the weirder covenants were some of the more fun covenants that existed.-This is one of my biggest negatives, but also not a big issue in the grand scheme of things.  There are 2 returning covenants in the game that perform the exact same duties.  The blue sentinals from dark souls 2 and the blades of the darkmoon from dark souls 1.  I really do not see the point in having both of these covenants.  The way darkmoons should work is to use the eye orb to invade the world of sinners who invade other players, and let blue sentinels do the guarding of the way of the blue members.  This just feels incredibly lazy, redundant, and a massive oversight into the possibilities of the coolness of the darkmoons.-Probably the most objective negative is with some weapon variety.  A lot of weapons have copy pasted movesets, with only the weapon art to differentiate them, and sometimes not even that.  A lot of weapons are objectively worse than others for this reason.  Boss soul weapons are also disappointingly underwhelming.  However each weapon class is very fun and different, so even if many play the same between weapon classes, there is lots of types to play with.Those cons aside, this game is incredible.  I highly recommend it, whether you are a fan of the series or not.  It takes all the best parts of the other games, mixes it into a nice dish, and adds its own twist to make it stand above the sum of its parts.  I was blown away, and it surpassed my expectations, which were already extremely high.  I hope that the multiplayer lasts a long time, as I will be playing for years to come."
    },
    {
        "Recommended": 1,
        "Hours_Played": 206.1,
        "Comments": "Posted: September 13, 2016              If you liked dark souls 1 or 2 then just buy this game as it's basically the same formula with some tweaks.If you've never played a souls game then let me ask you these questions: Does the idea of facing a moderately tough (for a souls game) boss in the first 5 minutes, without any level ups or extra equipment, sound appealing to you?Do you like dark fantasy? (If you're a fan of berserk then this is definitely the game for you)Do you want a game challenging enough where even the most basic enemies can kill you very quickly if you mess up?If the answer yes then is this the game for you, if not then get gud or get out."
    },
    {
        "Recommended": 1,
        "Hours_Played": 529.0,
        "Comments": "Posted: December 19, 2017              you can eat white branches and turn into boxes12/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 98.8,
        "Comments": "Posted: May 12, 2018              Had to Alt F4 to avoid dying to some weeb with anime powers...Thank you Dark Souls, very cool!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 130.2,
        "Comments": "Posted: September 5, 2016               One word for each aspect of this game. Story - Alluring.Characters - Intriguing.Gameplay - Endearing.Roleplaying - Average.Immersion - Gripping.Environment - Transcendental.Graphics - Gorgeous.Sound - Great.Music - Enchanting.Overall - Enthralling."
    },
    {
        "Recommended": 1,
        "Hours_Played": 485.9,
        "Comments": "Posted: May 15, 2017              The Dark Souls 3 Community is cancerous & trash. There won't be one day where you don't meet someone spamming, trolling, cheating, hacking, & of course pointing down after they kill you in the most annoying way possible. You might come across some friendly players, but very rarely if at all. Even I find trouble not wanting to be trash because everyone else is to me & shows no respect. It's a cycle of getting trolled all the time, getting mad then turning into one of the cancerous players yourself. As for the game itself I have 2 words. Buy It. I've beaten this game at least 60 times between Xbox One, PS4, & Steam. I have all the achievements for it. You will be put to the test of beating one of the hardest games known to the general gaming community. You will die, over, over, & over again. You will think that it's impossible after being stuck on a boss for 4 hours. I have personally been through hell when I started playing Dark Souls, but in the end it is worth it. It is a amazing game.Even though the community isn't great I still recommend this.You can enjoy the game & the community even if you're a friendly player like myself, just be prepared to have a lot of patience. Otherwise you will end up either quitting the game, or turning into a sh*tty player like everyone else by the time you beat it.Praise The Sun ☼"
    },
    {
        "Recommended": 1,
        "Hours_Played": 110.9,
        "Comments": "Posted: April 2, 2018           Product received for free              It's Dark Souls.It also has one of the worst gaming communities everI love it"
    },
    {
        "Recommended": 1,
        "Hours_Played": 208.4,
        "Comments": "Posted: March 20, 2018              try tongue but hole. be wary of of invasions"
    },
    {
        "Recommended": 1,
        "Hours_Played": 327.1,
        "Comments": "Posted: November 11, 2016              The most beautiful dark fantasy game ever"
    },
    {
        "Recommended": 1,
        "Hours_Played": 554.3,
        "Comments": "Posted: April 11, 2016              The Dark Swolles Experience.For every death, do 10 push ups.Git Gud or Get Ripped."
    },
    {
        "Recommended": 1,
        "Hours_Played": 580.1,
        "Comments": "Posted: July 4, 2016              The sequel to Dark Souls 1 that we deserved. I love the series - and so, let's get down to the things I dislike about the game. >>RANT BEGINS<<*Extremely linear in comparison to Dark Souls 1, and extremely short in comparison to Dark Souls 2*I was never a fan of sorcery, or how overpowered it seemed to be in the previous game. For some reason, though, sorcery seems to have been gimped considerably, way more than I'd like. Being an effective sorcerer now requires full commitment with very little in the way of build flexibility or room to explore. You'll still melt most everything in the game - but it will feel significantly less fun.*From seems to have delighted in nerfing Faith to oblivion for a long time now, and this game may just be the worst example yet. As of Patch 1.09, there are actually A COUPLE actual Faith weapons, and offensive miracles are MARGINALLY useful in certain controlled circumstances, now. Before recent patches, it was entirely useless.*Most weapons seem recycled from the previous two games, with not much in the way of new weapons. Though there are plenty of boss weapons, Dark Souls 3 seems to have largely ignored the Dark Souls 2 quality-of-life improvements that made boss weapons actually useful. As it stands, very few of them are even viable. The same can be said for most offensive spells, as well.*The Poise reworking means that heavy armor is now almost meaningless, save for large weapons' hyper-armor. Anything but the lightest of armors feels like a waste.*Although I am not fond of Dark Souls 2 in general, I have to admit that that game went to considerable lengths to make most weapon builds viable. Dark Souls 3 seems to have thrown all of that out of the window. Cookie-cutter builds are sadly all too common as a result, with not a lot of the flexibility, variability and surprise aspect that PvP (and even PvE) had in the second installment.*NPCs seem to have considerably less dialogue this time around.*Covenants are mostly broken and largely meaningless.>>RANT ENDS<<With all that said? Dark Souls 3 is a wonderful game, and feels like a true successor to the original Dark Souls, even if it doesn't quite manage to be as good as the first installment. The controls feel amazing, the enemy and boss design are as strong as ever - if not stronger - and the world and lore are worthy of the name. Weapon Arts add an interesting layer to combat, Focus Bars instead of Spell Casts (as it was in Demon's Souls) increase flexibility. The music -might- just be the best in the series (though that's obviously heavily subjective). NPCs have less dialogue overall, but almost every single one of them has a questline to pursue. In truth, these may not feel like groundbreaking changes from the first game, and really, they aren't. Yet, Dark Souls was never really about innovation for the sake of innovation, but solid design polished to a mirror sheen. And even though Dark Souls 3 has a few flecks of tarnish, it is a fitting and satisfying closing to this beloved, genre-spawning series, and even with it's flaws, it's better than most games out there."
    },
    {
        "Recommended": 1,
        "Hours_Played": 169.8,
        "Comments": "Posted: May 24, 2018              The first time you play throught this game you will have a decent amount of trouble, however souls veterans shouldnt have trouble with it. It'll be tough the first time, listen to what the game is telling you to do trust me, this isn't a game that you want to just skip out on the story, plus you'll end up lost a few times if you don't listen, though that might've just been my stupidity. Anyway, would I recommend this game? Yes, for sure, the PvE is fairly good, there have only been a few times I've been killed and got mad at the game for it being BS, but if you take your time, go in carefully, you shouldn't have trouble with any of the enemies in the game, just remember, the size of an enemy doesn't matter, poise is a lie, and prepare to die."
    },
    {
        "Recommended": 1,
        "Hours_Played": 278.9,
        "Comments": "Posted: August 16, 2017              Online Dark Souls III Experience in a nutshell:-bunch of guys swinging buffed washing poles-magic users using point down gesture-people with ultra greatswords spamming r1-all of the above except teleporting all over the place11/10 would waste all my embers outside of pontiff again"
    },
    {
        "Recommended": 1,
        "Hours_Played": 35.2,
        "Comments": "Posted: September 14, 2018              Died in Main Menu11/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 270.9,
        "Comments": "Posted: August 9, 2017              its like crash bandicoot with swords"
    },
    {
        "Recommended": 1,
        "Hours_Played": 63.8,
        "Comments": "Posted: November 1, 2018              Try tongue, but hole"
    },
    {
        "Recommended": 1,
        "Hours_Played": 162.4,
        "Comments": "Posted: March 18, 2017               Pedro the Friend  Playing with my friendos we get invaded by 'Pedro the Friend' He looks like a old creepy dude but he wasnt that creepy he was kinda nice he helped my friend get through the game showing him the items and all, We got a blue spirit summoned through concord named Peter Pain he was nice he understood pedro was there to help. He fell in a hole and died we all prayed for Peter. Later on we got another blue spirit summoned through concord his name was Kaikai he seemt cool but he backstabbed Pedro the second he got the chance he died... Now we're all praying in Cathedral Of the Deep for Pedro to return.  We hope to meet you again Pedro, Forever in our hearts  We miss you Pedro Edit:  We found Pedro yet again, He fell off a ledge and died shortly after  Pedro if you find this review please add me, sincerely binkedink."
    },
    {
        "Recommended": 1,
        "Hours_Played": 355.3,
        "Comments": "Posted: June 5, 2018              hard but fair"
    },
    {
        "Recommended": 1,
        "Hours_Played": 667.8,
        "Comments": "Posted: January 24, 2017              Never played a Dark Souls game up until this one - It was a very punishing experience, learning that one needs to git-gud to continue playing... I must have spent the first couple of days (on and off) trying to get past the first boss...nothing beats that feeling of defeating a boss and moving onto the next area. This is an absolute must-play! You wont regret it!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 265.6,
        "Comments": "Posted: April 26, 2018              You play as a pony in a new world, making friends with all the creatures you meet."
    },
    {
        "Recommended": 1,
        "Hours_Played": 265.6,
        "Comments": "Posted: April 26, 2018              You play as a pony in a new world, making friends with all the creatures you meet."
    },
    {
        "Recommended": 1,
        "Hours_Played": 338.7,
        "Comments": "Posted: May 2, 2017              8/10.This is the first Dark Souls game I've actually gotten past the first boss in. Played the first game, briefly, back when it came out and didn't play another From Software game until Bloodborne(which I'd give a 10/10(Seriously, check it out)).Dark Souls 3 is an absolutely gorgeous game. It's exactly what you'd expect from a From Software game(Plus some).*PC version is definiately the superior version* ⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺⎺Pros:+ Beautiful setting+ Terrifying creatures+ Challenging boss battles(most)+ Solid Leveling+ Multiple endings+ Multiple hidden questlines+ 8 base game covenants+ Co-op/Invading is very entertaining+ Tons of Armor/Weapons/Sorceries/Miracles/Pyromancies/etc.+ The Carvings(Hello, Thank You, Very Good, I'm Sorry and Help Me)Cons:- Certain areas become stuttery(even with a high-end PC)- Bugs here and there(these tend to be fixed pretty quickly)- Cheaters(Online only)- Poise is just weird in DS3- Not much replay value- Certain Covenant rewards are nearly impossible to get"
    },
    {
        "Recommended": 1,
        "Hours_Played": 231.9,
        "Comments": "Posted: September 15, 2017              This was my First ever Souls game.On killing the first enemy(not the boss),I kind of felt, Is this the game that seemed to be so difficult. Upon encountering the first boss, This game was not meant for me. Now,having beaten this game,I wanna play the entire series.P.S-Game content intended for matured players,not for Weak Hearted and Patientless people.If you are reading this,then dont forget to: PRAISE THE SUN"
    },
    {
        "Recommended": 1,
        "Hours_Played": 43.4,
        "Comments": "Posted: December 27, 2017              The best installment of the glorious Dark Souls series,this is the first of it's games to be developed for PC and later ported to consoles and thus it runs smoothly and looks great.A lot could be said about this game but words cannot do it justice,all i can say is that Dark Souls 3 is a truly sublime gaming experience in every respect."
    },
    {
        "Recommended": 1,
        "Hours_Played": 302.8,
        "Comments": "Posted: August 28, 2017              The sun is a wondrous body. Like a magnificent father!If only I could be so grossly incandescent!Let us engage in Jolly Co-Operation and, after we kill the dragon, praise the sun together!The only thing this game needs more of, is a larger sun onto which I could praise even more!"
    },
    {
        "Recommended": 1,
        "Hours_Played": 237.7,
        "Comments": "Posted: July 13, 2018              This game is a game."
    },
    {
        "Recommended": 1,
        "Hours_Played": 303.2,
        "Comments": "Posted: July 24, 2017              I love this game, but there are a few issues you should know before purchasing. So I guess these will be cons first, then I'll hit up the pros.CONS: My biggest gripe with this game (there is another one, we'll get there) has to be the optimization. There's no settings that drastically affect FPS in any real sort of way, aside from resolution and the more prominant,  oh of course these settings will affect FPS . But those are only one or two settings. Textures, shadows, reflections, all of that jazz can be set to medium/high settings and you won't see any difference in FPS if you usually played on low. This sounds good, yes, but if you're wanting to get rid of that constant 40 FPS in one area, you're not going to have any settings to help increase those frames. And frames are important in this game. The other big gripe I have has to do with the camera. The camera controls have been seemingly downgraded from the past souls games, which I didn't think was entirely possible. Dark Souls 1 had a great lock on system, where you could lock onto an enemy from further away and it KNEW what you were wanting to lock onto. If you were surrounded by enemies in DKS1, changing lock on to a different target was a breeze. But in DKS3, sometimes that changing enemy lock on move just doesn't work. Getting attacked by a giant crab that deals half of your HP while simultaniously being surrounded by tiny crabs that do hardly any? Which do you think lock on SHOULD lock onto? The massive crab or the little one? Apparently it thinks that the little crab is more of a threat, thus ending your character's life with one swift claw strike. Awful!Pro tip: a lot of bigger enemies have SUPER slow wind up attacks. It's hard to predict a lot of the time, but with practice you should counter it well. It can be very annoying to get hit by slow attacks because you expect them to be faster, but it's okay. Onto the pros:I'll keep these short because all the other praise has been said in other reviews. Bosses are fantastic for the most part. Each boss has a personality and backstory that makes fighting them either extremely exciting or super sad. Each boss has a second (sometimes third) stage which can throw you into a fit of rage, or make you shrug because not that much has changed. But the intensity is fantastic in these stages.The lore in this game takes after the lore from Dark Souls 1. While you don't need to know exactly what you're doing in order to play and have fun, it's suggested that you either buy and beat Dark Souls 1 (and 2, if you want, but nothing significant really happens there, not from what I can remember). Or watch lore videos on youtube, whichever works for you. Either way, the story unravels in item descriptions and they're probably the most entertaining thing to speculate and hear about when you're not actually playing the game. The story is amazing, you just have to think a little.And finally, my favorite thing about this game, is the fact that it took everything that I loved from Dark Souls 1 and made it better while also removing everything I hated about it, too. For example, you shouldn't need to know how to toggle escape from a Chaos Zweihander, you shouldn't hate invasions because of backstab fishers and abusers. I think that's about it for what I have to say. Tl;DR: it's pretty fun, worth the money, buy it. PS: Get the Ringed City DLC first if you don't have enough for both DLC's.PPS: dark souls 3 did invasions right, fight me about it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 350.9,
        "Comments": "Posted: February 16, 2018              This game is not for the impatient or easily frustrated... That said.OverviewDark Souls III introduces a new a way of approaching fiends and phantoms in combat. This requires (you)the player to learn the ropes of the game through enemies. The movement is fast and unique, and so are the enemy's movements that make it a challenge at first. The Unique sets of weaponry combined with armor, fashioned along with formidable enchantments. This can create awe-inspiring characters that can fend off other players in fear. Otherwise, creating a challenge for other players or the enemies that trying to conquer over. The gist of this only prepares players for the awaiting doom of weaving through a boss's attack and striking back.SceneryThe monumental buildings and cryptic tombs that are surrounded by a torn down world the player travels through. Createing an ominous setting the player can only assume they are in for trouble. The ambient of rooms obscure hidden paths that could not be found without aid from other players. Play Style Although, a weapon with a blade is reccomended the game allows the player to add attribute points towards specific stats. This not only allows the player to use certain items at their potential but it also lets them choose their way of player. These are the main builds I have observed.. (Pyromancy, Miracle, Intellegence, Archers, and Swordsmen). The diversity players can approach an enemy are unique and each weapon has it's unique style of play.StoryThe story revolves around the player(Unkindled), rising from a pile of ash that must seek out the Lords of Cinder to return them to their thrones and assume their souls as a new champion. The player must seek out to restore a successful linking to the  flame .Some important technical Information*The game's aspect ratio can change the brightness to a high an absurd high value.*It's reccomended you get a Nvidia 900 series card or the AMD equivalent with a four core processor.*V-sync is very useful in the game and eliminates tearing issues very well."
    },
    {
        "Recommended": 1,
        "Hours_Played": 237.7,
        "Comments": "Posted: December 12, 2017           Product received for free              Before I played Dark Souls :／ﾌﾌ 　　　　　　 　 ム｀ヽ / ノ) 　　　　　　　　　｜ ｜/ ｜　　(͡ ͡° ͜ つ ͡͡°) ⌒（ゝ._,ノ /　ﾉ⌒7⌒ヽーくー ＼　／ 丶＿ ノ ｡　　 ノ､　｡|/ 　　 `ヽ `ー-'_人`ーﾉ 　　　 丶 ￣ _人'彡)After I played Dark Souls :░░░░░░░░░░░░▄▐░░░░░░▄▄▄░░▄██▄░░░░░▐▀█▀▌░░░░▀█▄░░░░░▐█▄█▌░░░░░░▀█▄░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░░░░▄▄▄██▀▀▀▀░░░█▀▄▄▄█░▀▀░░░▌░▄▄▄▐▌▀▀▀▄░▐░░░▄▄░█░▀▀ ▀█▌░░░▄░▀█▀░▀░░░░░░░▄▄▐▌▄▄░░░░░░░▀███▀█░▄░░░░░░▐▌▀▄▀▄▀▐▄░░░░░░▐▀░░░░░░▐▌░░░░░░█░░░░░░░░█░░░░░▐▌░░░░░░░░░█░░░░░█░░░░░░░░░░▐▌"
    },
    {
        "Recommended": 1,
        "Hours_Played": 276.4,
        "Comments": "Posted: April 1, 2017              Died in the Titlescreen"
    },
    {
        "Recommended": 1,
        "Hours_Played": 121.8,
        "Comments": "Posted: June 29, 2016              So, having played the other souls games to death, I decided I'd challenge myself and roll up a deprived build. Being the lazy ♥♥♥♥♥♥♥ that I am, I decided that I wasn't going to get any new weapons or armor after I picked a set I liked. Now let me tell you guys.... I was wearing the rags from the uchigatana master, and the sages hat.... I was wielding the starting club, and grass crest shield.I played the game to the best of my ability, and I played the whole thing solo. I was having a ton of fun.The enemies were faster than all the other games, but I could demon souls roll now.... none of their attacks mattered so long as I  Got gud . And gud I was... for I had played the others. Now somewhere in my head I had this crazy idea that no one would think of normally in dks1.  What if I go raw on my club for max physical without ever having to put a point in my str or dex? .  I was thinking in my head, the scaling would be horrible, the damage wouldn't last, I would die before I killed anything.I went on to beat every boss with that ♥♥♥♥♥♥ little raw club, without help from summons, NPC or otherwise. Since I had no need for my souls I dumped them all into health and stamina. My friends and I got the game at the same time, and I was the first to finish. Not only that, when they had complained about certain areas that were built to exploit the weakness of their builds, I had powered through them. When they had mentioned some annoying bosses, I had beat them on my first try.My faith in Miyazaki had carried me through. I learned that through my self imposed suffering that I had found the perfect PVE build. Everything else in the game was put in, with its promises of power if only I would stray from my path.... from my God Miyazaki's teachings. I denied them all and was rewarded.(PS the club is♥♥♥♥♥♥for pvp, don't even bother. I still pwnt people tho b/c they were scrubs.) Once I had completed this journey and basked in the immense euphoria of beating a souls game with a club basically naked. I had something in my inventory.... a certain greatsword from a certain prince with C, D, D, D scaling in the four main stats.I knew what I must do. I pumped every point henceforth into those four stats while still in rags and that overly gigantic hat. I went on to rip entire thirds and fourths off of boss healthbars in new game +.For everyone who gives a bad review because something that was once the right way has been changed, you must change. You must embrace Miyazaki and cast aside your worldly desires for defense, poise, damage, range. You must cast aside your shield, you must cast aside everything that you believe to be a reasonable choice against an army of monsters and use your faith in Miyazaki as a weapon. (And not a faith build, club > lightningbolts.)I have seen the light, and I have been rewarded. You can experience unbridled bliss and joy, by ascending to paradise. When I arrived, it all faded to black as that last ember slowly died. Through the deafening silence, only two words filled my mind. Two words described what had happened. Why I had succeeded and where others had failed. Two words that described my journey. Two words that embodied my faith in Miyazaki. Two words I had lived by since I first played, even kings field and evergrace! TWO WORDS RANG THROUGH MY MIND OVER AND OVER! I had broken down into tears because I had found the answer and stayed true over all these years...And I will tell you what they said to me... Git gud."
    },
    {
        "Recommended": 1,
        "Hours_Played": 80.7,
        "Comments": "Posted: October 2, 2017              Champion Gundyr is what would've happened if Gregor Clegane and Oberyn Martell had a baby.you dead/10"
    },
    {
        "Recommended": 1,
        "Hours_Played": 193.7,
        "Comments": "Posted: April 22, 2017              Buy it.Git Gud.Love it."
    },
    {
        "Recommended": 1,
        "Hours_Played": 418.7,
        "Comments": "Posted: December 19, 2018              a lot of cute single girls play this game"
    },
    {
        "Recommended": 1,
        "Hours_Played": 4.6,
        "Comments": "Posted: December 27, 2017              Remember that teacher in school who always picked on you or made your life hard? Remember that kid who didn't like you and picked on you? Remember that test you didnt study for and failed? Well, everyone is like that in Dark Souls 3. It took me 3 hours...to get past the tutorial. I recommend this game for BDSM fans and masochists. 10/10 from masochists all around the world."
    },
    {
        "Recommended": 1,
        "Hours_Played": 141.7,
        "Comments": "Posted: November 26, 2017              EA should play this to learn that greed will lead to death..."
    },
    {
        "Recommended": 1,
        "Hours_Played": 240.9,
        "Comments": "Posted: November 22, 2017              I'd rather watch my kingdom fallI want it all or not at all"
    },
    {
        "Recommended": 1,
        "Hours_Played": 115.2,
        "Comments": "Posted: May 13, 2017              If pain and suffering is a favorite pastime, then this is the game for you."
    },
    {
        "Recommended": 1,
        "Hours_Played": 162.1,
        "Comments": "Posted: August 8, 2018              Prepare to get bullied by teleporting dogs and hard bosses..."
    },
    {
        "Recommended": 1,
        "Hours_Played": 427.7,
        "Comments": "Posted: March 12, 2017              My first experience with Dark Souls III:As this was my first Dark Souls game of the series I haven't played (well... finished) any of the other Dark Souls games. And the reason is simply because Dark Souls II's hitboxes are too broken for me to enjoy it and I don't have a controller to play Dark Souls I. YES that means I finished Dark Souls III with a mouse and keyboard..... But I will tell you this for all the people who are still unsure to buy this because they don't have a controller. Mouse and keyboard works perfectly fine! A controller might be  The best Dark Souls experience  but as a PC gamer I wish to play games on a mouse and keyboard and not be expected to buy a controller to play a certain game. One of the most beautiful things about Dark Souls III is the music. The music is simply stunning! It fits perfectly in every area and it really gets you into the dark atmosphere that surrounds the Kingdom of Lothric. The cutscenes are also very well made and really get you hyped to get into the game to learn more about its dark story. The diologue voice acting is very well done and makes you actually want to listen to what the characters have to say.As for the bad part of the game, since no game is ever perfect. The port from console to PC is kind of horrible.... First of all you have to navigate through the menu using E as enter and Q to go back (DAFUQ?!) and all the controls are displayed as controller buttons. Which is very annoying when you are new to the Dark Souls series and first play through the game. There are tutorial messages but ofcourse they all display the controls with controller buttons aswell... Thanks to this you have to open up the options and look at all the keybindings to see what button is the equivalent of the controller button displayed. But becides all that, once you learn the controls you should get the hang of it fairly quickly and you will get used to it in no time.Right now i'm about halfway through new game plus which some of the borderlands players might recognize as true vault hunter mode (you basicly play through the game again with your same character and you get to keep all your weapons and stats but everything is slightly more difficult) and I am still enjoying every second of it. I see now how some people have spent over 300 hours on this game because it simply never gets boring. YES it will get frustrating at times but you just have to keep going and not give up! It is perfectly fine to take a little break though when you are having trouble with a certain area / boss. As I have done this plenty of times aswell and that really allowed me to keep enjoying the game without getting mad at it too much. If you keep having trouble beating an area or boss you can summon a friendly player to help you out as there are plenty of people out there willing to give you a hand.I know not everyone will agree with my opinions and this certainly won't be the same for everyone. If you are into RPGs, like finding new items and gear and are up for a challenge. I'd say buy it and see for yourself! Don't let the fanboys discourage you or the fact that you might not have a controller. But don't buy the game and then get mad that the controlls are ♥♥♥♥ed because it is already very clear that Dark Souls games have ♥♥♥♥♥♥ console ports.Conclusion:Great game, great atmosphere and an amazing dark story. But keep in mind that it is a bad console port and if you are planning to play it with mouse and keyboard you will have to deal with the consequences. I say it is worth a buy but not everyone can enjoy it like I did."
    }
]